lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
#include "openvlc_stm32_hal.h"
#include "openvlc_stm32_tx_hal.h"
#include "openvlc_phy.h"
#include "openvlc_crc.h"

#include <stdarg.h>
#include <stdio.h>
#include <string.h>

#if defined(__has_include)
#if __has_include("openvlc_board.h")
#include "openvlc_board.h"
#endif
#endif

#if defined(STM32H743xx) || defined(STM32H723xx)
#include "stm32h7xx_hal.h"
#include "stm32h7xx_it.h"
extern UART_HandleTypeDef huart3;
extern TIM_HandleTypeDef htim2;
extern COMP_HandleTypeDef hcomp1;
extern DAC_HandleTypeDef hdac1;
extern void Error_Handler(void);
#endif

extern volatile uint32_t openvlc_rx_hypothesis_budget;
extern volatile uint32_t openvlc_phy_dbg_stage;
extern volatile uint32_t openvlc_phy_dbg_sample_len;
extern volatile uint32_t openvlc_phy_dbg_sps;
extern volatile uint32_t openvlc_phy_dbg_len_raw;
extern volatile uint32_t openvlc_phy_dbg_payload_len;
extern volatile int32_t openvlc_phy_dbg_parse_status;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_single;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_split;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_cell0;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_cell1;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_train;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_syncs;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_maxbits;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_lenraw;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_result;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_pre_rejects;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_pre_badmax;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_pre_sfdmin;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_sfd_errors;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_lock_cell;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_relocks;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_mode;
extern volatile uint32_t openvlc_phy_dbg_phase_edits;
extern volatile uint32_t openvlc_phy_dbg_track_cell0_end;
extern volatile uint32_t openvlc_phy_dbg_track_cell1_end;
extern volatile uint32_t openvlc_phy_dbg_track_nominal_end;
extern volatile uint32_t openvlc_phy_dbg_timing_residual_peak;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_fail_timing;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_fail_no_sfd;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_fail_preamble;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_fail_parse;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_fail_crc;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_fail_len;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_fail_overflow;
extern volatile uint32_t openvlc_phy_dbg_sfdsync_fail_incomplete;

#if defined(__GNUC__)
#define OPENVLC_DMA_BUFFER __attribute__((section(".dma_buffer"), aligned(32)))
#define OPENVLC_RX_BUFFER __attribute__((section(".rx_buffer"), aligned(32)))
#define OPENVLC_CPU_BUFFER __attribute__((section(".cpu_buffer"), aligned(32)))
/* First 128 KB of RAM_D1, covered by the non-cacheable MPU region (main.c). */
#define OPENVLC_DMA_RING __attribute__((section(".dma_ring"), aligned(32)))
#define OPENVLC_RX_HOT __attribute__((hot, optimize("O3")))
#define OPENVLC_RX_INLINE static inline __attribute__((always_inline))
#else
#define OPENVLC_DMA_BUFFER
#define OPENVLC_RX_BUFFER
#define OPENVLC_CPU_BUFFER
#define OPENVLC_DMA_RING
#define OPENVLC_RX_HOT
#define OPENVLC_RX_INLINE static inline
#endif

static uint16_t dma_selftest_word OPENVLC_DMA_BUFFER;
static uint16_t rx_accum_buffer[OPENVLC_RX_SAMPLE_BUFFER_LEN] OPENVLC_RX_BUFFER;
volatile uint32_t openvlc_stm32_start_step;
volatile uint32_t openvlc_mem_test_step;
volatile uint32_t openvlc_mem_test_result;
volatile uint32_t openvlc_comp_start_step;
volatile uint32_t openvlc_comp_dma_cr;
volatile uint32_t openvlc_comp_dma_fcr;
volatile uint32_t openvlc_comp_dma_ndtr;
volatile uint32_t openvlc_comp_poll_step;
volatile uint32_t openvlc_comp_poll_head;
volatile uint32_t openvlc_comp_poll_tail;
volatile uint32_t openvlc_comp_poll_burst_len;
volatile uint32_t openvlc_comp_level_samples;
volatile uint32_t openvlc_comp_level_changes;
volatile uint32_t openvlc_comp_test_zero_high;
volatile uint32_t openvlc_comp_test_full_high;
volatile uint32_t openvlc_comp_test_zero_dor;
volatile uint32_t openvlc_comp_test_full_dor;
static uint32_t openvlc_comp_last_level;
static bool openvlc_comp_level_valid;

int openvlc_stm32_memory_selftest(void)
{
	volatile uint16_t *dma = &dma_selftest_word;
	volatile uint16_t *rx = rx_accum_buffer;

	openvlc_mem_test_step = 1u;
	dma[0] = 0x0123u;
	openvlc_mem_test_step = 2u;
	rx[0] = 0x0456u;
	openvlc_mem_test_step = 3u;
	openvlc_mem_test_result = ((uint32_t)dma[0] << 16) | rx[0];
	openvlc_mem_test_step = 4u;
	return openvlc_mem_test_result == 0x01230456u ? 0 : -1;
}

/*
 * Comparator + TIM2 CH4 input-capture receiver.
 *
 * COMP1 slices PB0 vs DAC1_CH1 (hysteresis). Its output is routed internally to
 * TIM2_TI4; TIM2 timestamps both edges via DMA at the rate selected by
 * OPENVLC_TIM2_IC_TICK_HZ (16 MHz for the validated budget-100 profile).
 * Edges are grouped into bursts (split on idle gaps) and decoded by
 * openvlc_app_rx_edges().
 */
/*
 * 32768 edges x 4 B = exactly 128 KB: the ring fills the dedicated .dma_ring
 * section (first 128 KB of RAM_D1) which MPU region 1 marks NON-CACHEABLE so
 * the TIM2 DMA writes stay coherent with the D-cache-enabled CPU (see
 * main.c). 32768 edges = ~22 ms of backlog at the 1.5 M edge/s budget-50
 * flood; with D-cache the per-frame decode leaves several ms of slack per
 * 7.46 ms frame period, so the backlog stays small (watch
 * openvlc_edge_ring_peak). Constraints if you change it: power-of-two MPU
 * region size, 16-bit DMA NDTR (<= 65535 entries), and the board's real
 * 320 KB AXI SRAM (STM32H723, not H743).
 */
#ifndef OPENVLC_EDGE_DMA_LEN
#define OPENVLC_EDGE_DMA_LEN 40960u
#endif
#ifndef OPENVLC_EDGE_BURST_LEN
#define OPENVLC_EDGE_BURST_LEN 32768u
#endif
/* TIM2 input-capture tick rate selected by the active board timing profile. */
#ifndef OPENVLC_TIM2_IC_TICK_HZ
#define OPENVLC_TIM2_IC_TICK_HZ 64000000u
#endif
/*
 * Idle longer than this ends a packet burst. The board timing profile sets
 * this from the Manchester cell duration. It must be shorter than the BBB
 * inter-frame service gap; otherwise queued frames merge and the single-frame
 * decoder returns only the first packet in the combined burst.
 */
#ifndef OPENVLC_EDGE_GAP_US
#define OPENVLC_EDGE_GAP_US 8u
#endif
#ifndef OPENVLC_EDGE_HARD_GAP_US
#define OPENVLC_EDGE_HARD_GAP_US OPENVLC_EDGE_GAP_US
#endif
#define OPENVLC_EDGE_GAP_TICKS ((OPENVLC_TIM2_IC_TICK_HZ / 1000000u) * OPENVLC_EDGE_GAP_US)
#define OPENVLC_EDGE_HARD_GAP_TICKS \
	((OPENVLC_TIM2_IC_TICK_HZ / 1000000u) * OPENVLC_EDGE_HARD_GAP_US)
#ifndef OPENVLC_EDGE_MIN_INTERVAL_TICKS
#define OPENVLC_EDGE_MIN_INTERVAL_TICKS 14u
#endif
#ifndef OPENVLC_RX_EDGE_FILTER_NONE
#define OPENVLC_RX_EDGE_FILTER_NONE       0u
#endif
#ifndef OPENVLC_RX_EDGE_FILTER_LEGACY
#define OPENVLC_RX_EDGE_FILTER_LEGACY     1u
#endif
#ifndef OPENVLC_RX_EDGE_FILTER_CONTEXTUAL
#define OPENVLC_RX_EDGE_FILTER_CONTEXTUAL 2u
#endif
#ifndef OPENVLC_RX_EDGE_FILTER_MODE
#define OPENVLC_RX_EDGE_FILTER_MODE OPENVLC_RX_EDGE_FILTER_LEGACY
#endif
#ifndef OPENVLC_EDGE_HARD_GLITCH_TICKS
#define OPENVLC_EDGE_HARD_GLITCH_TICKS \
	(OPENVLC_EDGE_MIN_INTERVAL_TICKS / 3u)
#endif
#ifndef OPENVLC_EDGE_CONTEXT_MARGIN_TICKS
#define OPENVLC_EDGE_CONTEXT_MARGIN_TICKS 2u
#endif
#ifndef OPENVLC_RX_CAPTURE_RAW
#define OPENVLC_RX_CAPTURE_RAW 0u
#endif
#ifndef OPENVLC_RX_CAPTURE_MAX_INTERVALS
#define OPENVLC_RX_CAPTURE_MAX_INTERVALS (OPENVLC_EDGE_BURST_LEN - 1u)
#endif
#ifndef OPENVLC_RX_CAPTURE_CHUNK_INTERVALS
#define OPENVLC_RX_CAPTURE_CHUNK_INTERVALS 384u
#endif
#if OPENVLC_RX_CAPTURE_CHUNK_INTERVALS > 442u
#error "OPENVLC_RX_CAPTURE_CHUNK_INTERVALS exceeds a 900-byte host record"
#endif

