lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
/*
 * Fragment-size window used only for the FRAG diagnostic counters: a burst
 * ending in this range is bigger than noise but smaller than a whole packet.
 */
#ifndef OPENVLC_FRAG_MIN_EDGES
#define OPENVLC_FRAG_MIN_EDGES 100u
#endif
#ifndef OPENVLC_FRAG_MAX_EDGES
#define OPENVLC_FRAG_MAX_EDGES 11000u
#endif

/*
 * The TIM2 edge-capture ring is the only DMA-written RAM buffer. It lives in
 * the .dma_ring section = exactly the first 128 KB of RAM_D1 (AXI SRAM, which
 * DMA1 can reach; RAM_D2 on this H723 is only 32 KB). MPU region 1 marks that
 * 128 KB non-cacheable so the ring stays coherent with the D-cache-enabled
 * CPU; all the CPU-only buffers below are cacheable .rx_buffer.
 */
static uint32_t edge_dma_buf[OPENVLC_EDGE_DMA_LEN] OPENVLC_DMA_RING;
static uint32_t edge_burst[OPENVLC_EDGE_BURST_LEN] OPENVLC_CPU_BUFFER;
#if OPENVLC_RX_CAPTURE
/*
 * Adjacent intervals are always shorter than the burst delimiter (hundreds
 * of timer ticks), so uint16_t is exact and keeps the reusable snapshot to
 * 32 KB. This buffer is CPU-only and therefore belongs in DTCM.
 */
static uint16_t rx_capture_intervals[OPENVLC_RX_CAPTURE_MAX_INTERVALS]
	OPENVLC_CPU_BUFFER;
typedef enum {
	RX_CAPTURE_ARMED = 0,
	RX_CAPTURE_BEGIN,
	RX_CAPTURE_DATA,
	RX_CAPTURE_END,
	RX_CAPTURE_DONE,
} rx_capture_state_t;
static volatile rx_capture_state_t rx_capture_state = RX_CAPTURE_ARMED;
static uint32_t rx_capture_count;
static uint32_t rx_capture_position;
static uint32_t rx_capture_clipped;
static uint32_t rx_capture_id;
static int32_t rx_capture_status;
static int32_t rx_capture_parse_status;
static uint32_t rx_capture_t0;
static uint32_t rx_capture_t1;
static uint32_t rx_capture_nominal;
static uint32_t rx_capture_residual_q8;
static uint32_t rx_capture_syncs;
static uint32_t rx_capture_mode;
static uint32_t rx_capture_hypothesis_budget;
static uint32_t rx_capture_lock;
static uint32_t rx_capture_len_raw;
static uint32_t rx_capture_warmup_ok;
static uint32_t rx_capture_frame_gap;
static uint32_t rx_capture_failures;
static uint32_t rx_capture_successes;
static uint32_t rx_capture_threshold_dac;
static uint32_t rx_capture_snapshot_ms;
static uint32_t rx_capture_hash;
static uint8_t rx_capture_trigger;
static bool rx_capture_qualified;
static bool rx_capture_prepared;
#endif
static uint32_t edge_dma_tail;
static uint32_t edge_burst_len;
static uint32_t edge_burst_raw_len;
static uint32_t edge_last_tick;
static bool edge_have_last;
static bool edge_burst_overflowed;
static bool edge_capture_running;
static bool edge_sync_to_gap;
static bool edge_soft_gap_checked;
static uint32_t edge_soft_gap_len;
static openvlc_status_t edge_soft_gap_status;
static uint32_t edge_previous_burst_start;
static uint32_t edge_filtered_period_ticks;
static bool edge_period_valid;
volatile uint32_t openvlc_edge_bursts_decoded;
volatile uint32_t openvlc_edge_total;
volatile uint32_t openvlc_edge_overflows;
/* Inter-frame gaps the delimiter actually saw, counted BEFORE any burst is
 * formed or disposed of. bp/sp/okp all count bursts that reached decode, so
 * they cannot distinguish "the edges never arrived" from "they arrived and
 * something dropped them". This can: at 125 fps on the wire it must read 125. */
volatile uint32_t openvlc_edge_gaps_seen;
volatile uint32_t openvlc_edge_hw_overcaptures;
volatile uint32_t openvlc_edge_max_burst;
volatile uint32_t openvlc_edge_glitches;
#if OPENVLC_RX_RAW_INTERVAL_HIST
/* Pre-deglitch consecutive-edge bins: 0..7, 8..11, 12..15, 16..19, 20..23. */
static volatile uint32_t openvlc_edge_raw_short_hist[5];
#endif
volatile uint32_t openvlc_edge_capture_restarts;
volatile uint32_t openvlc_edge_partial_drops;
volatile uint32_t openvlc_edge_short_bursts;
volatile uint32_t openvlc_edge_run1_total;
volatile uint32_t openvlc_edge_run2_total;
volatile uint32_t openvlc_edge_run3_total;
volatile uint32_t openvlc_edge_long_total;
volatile uint32_t openvlc_edge_long_max_ticks;
volatile uint32_t openvlc_edge_last_raw_burst_len;
volatile uint32_t openvlc_edge_last_burst_len;
volatile uint32_t openvlc_edge_last_ok_burst_len;
volatile uint32_t openvlc_edge_last_fail_burst_len;
volatile uint32_t openvlc_edge_last_short_burst_len;
volatile int32_t openvlc_edge_last_decode_status = 99;
volatile uint32_t openvlc_decode_last_ticks;
volatile uint32_t openvlc_decode_max_ticks;
volatile uint32_t openvlc_rx_last_decode_budget;
/*
 * Comparator output duty accumulators, for the self-centering threshold servo.
 * A DC-balanced Manchester waveform makes the comparator spend equal time HIGH
 * and LOW only when the slice threshold sits on the signal DC mean, which is
 * exactly the single-cell eye centre. So duty=50% == centred threshold. We
 * measure it from the edge array we already have: the flush is triggered by an
 * idle gap, so the comparator level during that gap equals the level after the
 * burst's last edge; reading C1VAL at flush therefore fixes the polarity of
 * every run without an ADC. Accumulated in ticks over many bursts; the 1 Hz
 * poll reads the delta.
 */
volatile uint64_t openvlc_comp_duty_high_ticks;
volatile uint64_t openvlc_comp_duty_total_ticks;
volatile uint32_t openvlc_comp_duty_permille_last; /* last burst, for logging */
/*
 * Ring backlog watermark: highest number of captured-but-unprocessed edges
 * seen at poll entry. If this approaches OPENVLC_EDGE_DMA_LEN the ring is
 * about to wrap (silent loss) - the per-frame processing is too slow.
 */
volatile uint32_t openvlc_edge_ring_peak;
volatile uint32_t openvlc_edge_ring_drops;
/* Mid-packet split diagnostics: silences > EDGE_GAP inside a frame. */
volatile uint32_t openvlc_frag_count;
volatile uint32_t openvlc_frag_last_at;        /* edges seen before the hole */
volatile uint32_t openvlc_frag_last_gap_ticks; /* hole length, TIM2 ticks */
/* CRC/RS-confirmed candidate boundaries and retained incomplete prefixes. */
volatile uint32_t openvlc_edge_soft_gap_probes;
volatile uint32_t openvlc_edge_soft_gap_completed;
volatile uint32_t openvlc_edge_soft_gap_bridged;
volatile uint32_t openvlc_edge_soft_gap_reused;
volatile uint32_t openvlc_host_frames_queued;
volatile uint32_t openvlc_host_frames_sent;
volatile uint32_t openvlc_host_frames_dropped;
volatile uint32_t openvlc_host_tx_errors;
/* Own reflected frames (src == OPENVLC_TX_SRC_ADDR) dropped before forward. */
volatile uint32_t openvlc_rx_self_dropped;
static openvlc_quality_t openvlc_last_quality;
static uint32_t openvlc_last_quality_valid;

#ifndef OPENVLC_RX_DECODE_PASS_BUDGET_US
#define OPENVLC_RX_DECODE_PASS_BUDGET_US 5500u
#endif
#ifndef OPENVLC_RX_DECODE_DEADLINE_GUARD_US
#define OPENVLC_RX_DECODE_DEADLINE_GUARD_US 750u
#endif
#ifndef OPENVLC_RX_PERIOD_FILTER_SHIFT
#define OPENVLC_RX_PERIOD_FILTER_SHIFT 3u
#endif
#ifndef OPENVLC_SFD_SYNC_HYPOTHESES_MAX
#define OPENVLC_SFD_SYNC_HYPOTHESES_MAX 4u
#endif
#ifndef OPENVLC_RX_DECODE_PASSES_MAX
#define OPENVLC_RX_DECODE_PASSES_MAX OPENVLC_SFD_SYNC_HYPOTHESES_MAX
#endif

