lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
/*
 * Convert the measured packet cadence into the number of complete decoder
 * passes that fit before the next packet. Shorter periods take effect
 * immediately; longer periods are learned slowly. One missing frame in an
 * otherwise 125 fps stream therefore cannot authorize a 12-40 ms retry and
 * start a capture-ring congestion cascade.
 */
OPENVLC_RX_INLINE uint32_t edge_cadence_current_budget(void)
{
	uint32_t budget = 1u;

	if (edge_filtered_period_ticks != 0u) {
		uint32_t period_us = (uint32_t)(
			((uint64_t)edge_filtered_period_ticks * 1000000u) /
			OPENVLC_TIM2_IC_TICK_HZ);

		if (period_us > OPENVLC_RX_DECODE_DEADLINE_GUARD_US) {
			budget =
				(period_us -
				 OPENVLC_RX_DECODE_DEADLINE_GUARD_US) /
				OPENVLC_RX_DECODE_PASS_BUDGET_US;
			if (budget == 0u)
				budget = 1u;
		}
	}
	if (budget > OPENVLC_RX_DECODE_PASSES_MAX)
		budget = OPENVLC_RX_DECODE_PASSES_MAX;
	return budget;
}

OPENVLC_RX_INLINE uint32_t edge_cadence_hypothesis_budget(
	uint32_t burst_start)
{
	if (edge_period_valid) {
		uint32_t period = burst_start - edge_previous_burst_start;

		if (edge_filtered_period_ticks == 0u ||
		    period < edge_filtered_period_ticks) {
			edge_filtered_period_ticks = period;
		} else {
			uint32_t rise =
				(period - edge_filtered_period_ticks) >>
				OPENVLC_RX_PERIOD_FILTER_SHIFT;

			if (rise == 0u && period != edge_filtered_period_ticks)
				rise = 1u;
			edge_filtered_period_ticks += rise;
		}
	} else {
		edge_period_valid = true;
	}
	edge_previous_burst_start = burst_start;
	return edge_cadence_current_budget();
}

OPENVLC_RX_INLINE uint32_t edge_dma_head(void)
{
	DMA_HandleTypeDef *hdma = htim2.hdma[TIM_DMA_ID_CC4];
	uint32_t ndtr;
	uint32_t head;

	/* If the capture DMA was never linked/started, hdma is NULL; reading
	 * NDTR through it would hard-fault. Report "no new edges" instead. */
	if (!hdma || !hdma->Instance)
		return 0u;
	ndtr = __HAL_DMA_GET_COUNTER(hdma);
	if (!ndtr || ndtr > OPENVLC_EDGE_DMA_LEN)
		return 0u;
	head = (uint32_t)OPENVLC_EDGE_DMA_LEN - ndtr;
	return head >= OPENVLC_EDGE_DMA_LEN ? 0u : head;
}

static int edge_capture_start_dma(void)
{
#if defined(STM32H743xx) || defined(STM32H723xx)
	DMA_HandleTypeDef *hdma;

	HAL_NVIC_DisableIRQ(DMA1_Stream1_IRQn);
	if (HAL_TIM_IC_Start_DMA(&htim2, TIM_CHANNEL_4, edge_dma_buf,
				 OPENVLC_EDGE_DMA_LEN) != HAL_OK)
		return -1;
	hdma = htim2.hdma[TIM_DMA_ID_CC4];
	if (hdma && hdma->Instance) {
		__HAL_DMA_DISABLE_IT(hdma, DMA_IT_TC | DMA_IT_HT |
					   DMA_IT_TE | DMA_IT_DME);
		__HAL_DMA_DISABLE_IT(hdma, DMA_IT_FE);
		openvlc_comp_dma_cr = ((DMA_Stream_TypeDef *)hdma->Instance)->CR;
		openvlc_comp_dma_fcr = ((DMA_Stream_TypeDef *)hdma->Instance)->FCR;
		openvlc_comp_dma_ndtr = ((DMA_Stream_TypeDef *)hdma->Instance)->NDTR;
	}
	NVIC_ClearPendingIRQ(DMA1_Stream1_IRQn);
	HAL_NVIC_DisableIRQ(DMA1_Stream1_IRQn);
#endif
	edge_dma_tail = 0;
	edge_capture_running = true;
	return 0;
}

#if defined(STM32H743xx) || defined(STM32H723xx)
static uint32_t comp_count_high_samples(void)
{
	uint32_t high = 0u;
	uint32_t i;

	for (i = 0u; i < 65536u; i++) {
		high += (COMP12->SR & COMP_SR_C1VAL) != 0u ? 1u : 0u;
		__NOP();
		__NOP();
		__NOP();
		__NOP();
	}
	return high;
}
#endif

#if !OPENVLC_RX_HOST_FORWARD
static void edge_capture_stop(void)
{
#if defined(STM32H743xx) || defined(STM32H723xx)
	DMA_HandleTypeDef *hdma = htim2.hdma[TIM_DMA_ID_CC4];

	if (edge_capture_running) {
		/*
		 * HAL_TIM_IC_Stop_DMA() uses HAL_DMA_Abort_IT(). The COMP receiver
		 * intentionally disables DMA IRQs, so that asynchronous abort never
		 * reaches its completion handler and the next start fails HAL_BUSY.
		 * Stop the same hardware synchronously instead.
		 */
		htim2.Instance->CCER &= ~TIM_CCER_CC4E;
		__HAL_TIM_DISABLE_DMA(&htim2, TIM_DMA_CC4);
		if (hdma && hdma->Instance)
			(void)HAL_DMA_Abort(hdma);
		__HAL_TIM_DISABLE(&htim2);
		TIM_CHANNEL_STATE_SET(&htim2, TIM_CHANNEL_4,
				      HAL_TIM_CHANNEL_STATE_READY);
		TIM_CHANNEL_N_STATE_SET(&htim2, TIM_CHANNEL_4,
					HAL_TIM_CHANNEL_STATE_READY);
	}
	NVIC_ClearPendingIRQ(DMA1_Stream1_IRQn);
	HAL_NVIC_DisableIRQ(DMA1_Stream1_IRQn);
#endif
	edge_capture_running = false;
}
#endif

#if OPENVLC_RX_DIAG_LOG && !OPENVLC_RX_HOST_FORWARD
static int edge_capture_restart_synced(void)
{
	edge_burst_len = 0;
	edge_burst_raw_len = 0;
	edge_burst_overflowed = false;
	edge_have_last = false;
	edge_sync_to_gap = true;
	edge_soft_gap_checked = false;
	if (edge_capture_start_dma() != 0)
		return -1;
	openvlc_edge_capture_restarts++;
	return 0;
}
#endif

#ifndef OPENVLC_COMP_INTERVAL_DUMP
#define OPENVLC_COMP_INTERVAL_DUMP 0
#endif
#ifndef OPENVLC_RX_CAPTURE
#define OPENVLC_RX_CAPTURE 0u
#endif
#ifndef OPENVLC_RX_CAPTURE_PERIOD_MS
#define OPENVLC_RX_CAPTURE_PERIOD_MS 20u
#endif
#ifndef OPENVLC_RX_CAPTURE_ARM_AFTER_OK
#define OPENVLC_RX_CAPTURE_ARM_AFTER_OK 20u
#endif
#ifndef OPENVLC_RX_CAPTURE_MIN_EDGES
#define OPENVLC_RX_CAPTURE_MIN_EDGES OPENVLC_RX_MIN_DECODE_EDGES
#endif
#ifndef OPENVLC_RX_CAPTURE_MAX_FAILURES
#define OPENVLC_RX_CAPTURE_MAX_FAILURES 1u
#endif
#ifndef OPENVLC_RX_CAPTURE_MAX_SUCCESSES
#define OPENVLC_RX_CAPTURE_MAX_SUCCESSES 0u
#endif
#ifndef OPENVLC_RX_CAPTURE_MIN_FRAME_GAP
#define OPENVLC_RX_CAPTURE_MIN_FRAME_GAP OPENVLC_RX_CAPTURE_ARM_AFTER_OK
#endif
#ifndef OPENVLC_RX_CAPTURE_OK_FRAME_GAP
#define OPENVLC_RX_CAPTURE_OK_FRAME_GAP \
	OPENVLC_RX_CAPTURE_MIN_FRAME_GAP
#endif

/*
 * Per-burst trace for diagnosing packet fragmentation: one line per flush with
 * the burst length, the gap that ended it, and the decode outcome. Costs ~7 ms
 * of UART per burst at 115200 - enable only while characterising the link.
 */
#ifndef OPENVLC_BURST_TRACE
#define OPENVLC_BURST_TRACE 0
#endif

static uint32_t edge_burst_end_gap; /* ticks of the gap that ended the burst */
#if OPENVLC_COMP_RUN_ANALYSIS
static uint32_t edge_run_diag_phase;

static void edge_analyze_burst_runs(void)
{
	uint32_t run1 = 0u;
	uint32_t run2 = 0u;
	uint32_t run3 = 0u;
	uint32_t run_long = 0u;
	uint32_t long_max = 0u;
#if defined(STM32H743xx) || defined(STM32H723xx)
	/*
	 * Polarity of every run, fixed once from the idle level. The flush is
	 * gap-triggered, so the comparator holds the level after the burst's last
	 * edge; C1VAL now == that level (idle_level). Run i-1 (between edge[i-1]
	 * and edge[i]) has level = idle_level ^ ((edge_burst_len-i) & 1).
	 */
	uint32_t idle_level = (COMP12->SR & COMP_SR_C1VAL) != 0u ? 1u : 0u;
	uint64_t high_ticks = 0u;
	uint64_t total_ticks = 0u;
	bool duty_eligible = edge_burst_len >= OPENVLC_RX_MIN_DECODE_EDGES;
#if OPENVLC_COMP_DUTY_INVERT
	idle_level ^= 1u;
#endif
#endif

	if (edge_burst_len < 2u) {
		return;
	}

	for (uint32_t i = 1u; i < edge_burst_len; i++) {
		uint32_t run = edge_burst[i] - edge_burst[i - 1u];

		if (run < OPENVLC_COMP_RUN1_MAX_TICKS)
			run1++;
		else if (run < OPENVLC_COMP_RUN2_MAX_TICKS)
			run2++;
		else if (run < OPENVLC_COMP_RUN3_MAX_TICKS)
			run3++;
		else {
			run_long++;
			if (run > long_max)
				long_max = run;
		}
#if defined(STM32H743xx) || defined(STM32H723xx)
		/*
		 * Diagnostic duty must reflect the actual comparator waveform seen
		 * by the decoder. Count only decode-sized bursts to reject noise and
		 * short fragments, but include every internal run up to the configured
		 * burst delimiter. Excluding >=3-cell runs hid the exact failure mode
		 * we care about: lost transitions from a marginal slicer threshold.
		 */
		if (duty_eligible && run < OPENVLC_EDGE_GAP_TICKS) {
			uint32_t level =
				idle_level ^ ((edge_burst_len - i) & 1u);

			total_ticks += run;
			if (level)
				high_ticks += run;
		}
#endif
	}
#if defined(STM32H743xx) || defined(STM32H723xx)
	if (total_ticks) {
		openvlc_comp_duty_high_ticks +=
			high_ticks * OPENVLC_COMP_RUN_DIAG_DECIMATION;
		openvlc_comp_duty_total_ticks +=
			total_ticks * OPENVLC_COMP_RUN_DIAG_DECIMATION;
		openvlc_comp_duty_permille_last =
			(uint32_t)((high_ticks * 1000u) / total_ticks);
	}
#endif

