lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
	openvlc_edge_run1_total +=
		run1 * OPENVLC_COMP_RUN_DIAG_DECIMATION;
	openvlc_edge_run2_total +=
		run2 * OPENVLC_COMP_RUN_DIAG_DECIMATION;
	openvlc_edge_run3_total +=
		run3 * OPENVLC_COMP_RUN_DIAG_DECIMATION;
	openvlc_edge_long_total +=
		run_long * OPENVLC_COMP_RUN_DIAG_DECIMATION;
	if (long_max > openvlc_edge_long_max_ticks)
		openvlc_edge_long_max_ticks = long_max;
}
#endif

#if OPENVLC_RX_CAPTURE
static bool rx_capture_all_quotas_full(void)
{
	return rx_capture_failures >= OPENVLC_RX_CAPTURE_MAX_FAILURES &&
	       rx_capture_successes >= OPENVLC_RX_CAPTURE_MAX_SUCCESSES;
}

/*
 * Prepare one immutable interval snapshot. In raw mode this runs before edge
 * filtering; otherwise it receives the exact edge stream handed to the
 * decoder. It never formats text or queues UART data.
 */
static void rx_capture_prepare_edges(const uint32_t *edges, uint32_t edge_count)
{
	uint32_t interval_count;
	uint32_t hash = 2166136261u;

	rx_capture_prepared = false;
	if (rx_capture_state != RX_CAPTURE_ARMED || !edges || edge_count < 2u)
		return;

	interval_count = edge_count - 1u;
	if (interval_count > OPENVLC_RX_CAPTURE_MAX_INTERVALS)
		interval_count = OPENVLC_RX_CAPTURE_MAX_INTERVALS;
	rx_capture_clipped = (edge_count - 1u) - interval_count;
	for (uint32_t i = 0u; i < interval_count; i++) {
		uint32_t run = edges[i + 1u] - edges[i];

		if (run > UINT16_MAX) {
			run = UINT16_MAX;
			rx_capture_clipped++;
		}
		rx_capture_intervals[i] = (uint16_t)run;
		hash ^= (uint8_t)(run >> 8);
		hash *= 16777619u;
		hash ^= (uint8_t)run;
		hash *= 16777619u;
	}

	rx_capture_count = interval_count;
	rx_capture_hash = hash;
	rx_capture_prepared = true;
}

static void rx_capture_snapshot(openvlc_status_t status, bool successful)
{
	if (rx_capture_state != RX_CAPTURE_ARMED || !rx_capture_prepared ||
	    edge_burst_len < OPENVLC_RX_CAPTURE_MIN_EDGES)
		return;
	if (successful) {
		if (rx_capture_successes >= OPENVLC_RX_CAPTURE_MAX_SUCCESSES)
			return;
	} else if (rx_capture_failures >= OPENVLC_RX_CAPTURE_MAX_FAILURES) {
		return;
	}

	rx_capture_position = 0u;
	rx_capture_id++;
	rx_capture_status = (int32_t)status;
	rx_capture_parse_status = openvlc_phy_dbg_parse_status;
	rx_capture_t0 = openvlc_phy_dbg_sfdsync_cell0;
	rx_capture_t1 = openvlc_phy_dbg_sfdsync_cell1;
	rx_capture_nominal = openvlc_phy_dbg_track_nominal_end;
	rx_capture_residual_q8 = openvlc_phy_dbg_timing_residual_peak;
	rx_capture_syncs = openvlc_phy_dbg_sfdsync_syncs;
	rx_capture_mode = openvlc_phy_dbg_sfdsync_mode;
	rx_capture_hypothesis_budget = openvlc_rx_hypothesis_budget;
	rx_capture_lock = openvlc_phy_dbg_sfdsync_lock_cell;
	rx_capture_len_raw = openvlc_phy_dbg_len_raw;
	rx_capture_threshold_dac = HAL_DAC_GetValue(&hdac1, DAC_CHANNEL_1);
	rx_capture_snapshot_ms = HAL_GetTick();
	if (successful) {
		rx_capture_trigger = 0u;
		rx_capture_successes++;
	} else {
		rx_capture_failures++;
		if (openvlc_phy_dbg_parse_status == OPENVLC_ERR_CRC)
			rx_capture_trigger = 1u;
		else if (openvlc_phy_dbg_sfdsync_syncs == 0u)
			rx_capture_trigger = 2u;
		else if (openvlc_phy_dbg_parse_status == OPENVLC_ERR_ARG)
			rx_capture_trigger = 3u;
		else
			rx_capture_trigger = 4u;
	}

	/* Publish only after the complete snapshot and metadata are stable. */
	rx_capture_state = RX_CAPTURE_BEGIN;
}
#endif

/*
 * Decode a candidate packet boundary. A soft boundary is consumed only when
 * the complete frame passes CRC/RS; otherwise the filtered prefix stays in
 * edge_burst[] and acquisition continues. A hard boundary always accounts and
 * releases the candidate, preserving the existing failure diagnostics.
 */
static bool edge_flush_burst(bool final_boundary)
{
	uint32_t raw_burst_len = edge_burst_raw_len;
	uint32_t removed_edges = 0u;
	bool consumed = final_boundary;
	bool reuse_soft_failure = final_boundary && edge_soft_gap_checked &&
		edge_soft_gap_len == edge_burst_len &&
		edge_soft_gap_status != OPENVLC_OK;

	/* An overflowed burst cannot be decoded or captured; do no O(n) work. */
	if (!edge_burst_overflowed && !reuse_soft_failure) {
#if OPENVLC_RX_CAPTURE && OPENVLC_RX_CAPTURE_RAW
		rx_capture_prepare_edges(edge_burst, edge_burst_len);
#endif

#if OPENVLC_RX_EDGE_FILTER_MODE == OPENVLC_RX_EDGE_FILTER_LEGACY
		{
			uint32_t before = edge_burst_len;

			edge_burst_len = (uint32_t)openvlc_edge_cancel_short_pulses(
				edge_burst, edge_burst_len,
				OPENVLC_EDGE_MIN_INTERVAL_TICKS);
			removed_edges = before - edge_burst_len;
		}
#elif OPENVLC_RX_EDGE_FILTER_MODE == OPENVLC_RX_EDGE_FILTER_CONTEXTUAL
		edge_burst_len = (uint32_t)openvlc_edge_filter_timing_aware(
			edge_burst, edge_burst_len, OPENVLC_EDGE_MIN_INTERVAL_TICKS,
			OPENVLC_EDGE_HARD_GLITCH_TICKS,
			OPENVLC_EDGE_CONTEXT_MARGIN_TICKS, &removed_edges);
#elif OPENVLC_RX_EDGE_FILTER_MODE != OPENVLC_RX_EDGE_FILTER_NONE
#error "Invalid OPENVLC_RX_EDGE_FILTER_MODE"
#endif
		openvlc_edge_glitches += removed_edges;

#if OPENVLC_RX_CAPTURE && !OPENVLC_RX_CAPTURE_RAW
		rx_capture_prepare_edges(edge_burst, edge_burst_len);
#endif
	}

	openvlc_edge_last_decode_status = 99;
#if OPENVLC_COMP_INTERVAL_DUMP
	{
		/*
		 * One-shot: dump the head and tail intervals (timer ticks) of
		 * the first FAILING-sized burst (the ~7580-edge mystery bursts)
		 * so we can see whether a preamble is present at its start
		 * (uniform ~1-cell alternation) or it really starts mid-data
		 * (bimodal 1-cell/2-cell mix).
		 */
		static bool intv_dumped;

		if (!intv_dumped && edge_burst_len >= 7000u &&
		    edge_burst_len < 11000u) {
			intv_dumped = true;
			openvlc_platform_log("INTV burst_len=%lu head 48 intervals:\r\n",
					     (unsigned long)edge_burst_len);
			for (uint32_t i = 1; i < 49u && i < edge_burst_len; i += 16u) {
				char line[160];
				int pos = 0;

				for (uint32_t j = i; j < i + 16u && j < 49u &&
				     j < edge_burst_len; j++)
					pos += snprintf(line + pos,
							sizeof(line) - (size_t)pos,
							"%lu ",
							(unsigned long)(edge_burst[j] -
									edge_burst[j - 1u]));
				openvlc_platform_log("%s\r\n", line);
			}
			openvlc_platform_log("INTV tail 16 intervals:\r\n");
			{
				char line[160];
				int pos = 0;
				uint32_t start = edge_burst_len > 17u ?
					edge_burst_len - 16u : 1u;

				for (uint32_t j = start; j < edge_burst_len; j++)
					pos += snprintf(line + pos,
							sizeof(line) - (size_t)pos,
							"%lu ",
							(unsigned long)(edge_burst[j] -
									edge_burst[j - 1u]));
				openvlc_platform_log("%s\r\n", line);
			}
		}
	}
#endif
	if (!edge_burst_overflowed &&
	    edge_burst_len >= OPENVLC_RX_MIN_DECODE_EDGES) {
		openvlc_status_t decode_status;
#if defined(STM32H743xx) || defined(STM32H723xx)
		uint32_t decode_start = __HAL_TIM_GET_COUNTER(&htim2);
#endif

		{
			uint32_t cadence_budget = final_boundary ?
				edge_cadence_hypothesis_budget(edge_burst[0]) :
				edge_cadence_current_budget();

