lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
			/*
			 * Zero means unlimited to the portable decoder. Combine the
			 * cadence deadline with the pressure/TX limit selected by poll;
			 * the strictest non-zero limit wins.
			 * A speculative 4-us decode uses the learned cadence without
			 * advancing it; only a confirmed or hard boundary learns a new
			 * packet start.
			 */
			if (openvlc_rx_hypothesis_budget == 0u ||
			    cadence_budget < openvlc_rx_hypothesis_budget)
				openvlc_rx_hypothesis_budget = cadence_budget;
		}
		openvlc_rx_last_decode_budget =
			openvlc_rx_hypothesis_budget;
		if (reuse_soft_failure) {
			decode_status = edge_soft_gap_status;
			openvlc_app_commit_rx_failure(decode_status);
			openvlc_edge_soft_gap_reused++;
		} else if (final_boundary) {
			openvlc_app_rx_edges(edge_burst, edge_burst_len,
					     rx_accum_buffer,
					     OPENVLC_RX_SAMPLE_BUFFER_LEN);
			decode_status = openvlc_app_last_status();
		} else {
			openvlc_edge_soft_gap_probes++;
			decode_status = openvlc_app_try_rx_edges(
				edge_burst, edge_burst_len, rx_accum_buffer,
				OPENVLC_RX_SAMPLE_BUFFER_LEN);
			if (decode_status != OPENVLC_OK) {
				edge_soft_gap_len = edge_burst_len;
				edge_soft_gap_status = decode_status;
#if defined(STM32H743xx) || defined(STM32H723xx)
				openvlc_decode_last_ticks =
					__HAL_TIM_GET_COUNTER(&htim2) - decode_start;
				if (openvlc_decode_last_ticks >
				    openvlc_decode_max_ticks)
					openvlc_decode_max_ticks =
						openvlc_decode_last_ticks;
#endif
				return false;
			}
			consumed = true;
			openvlc_edge_soft_gap_completed++;
			/* Learn cadence only from a confirmed complete packet. */
			(void)edge_cadence_hypothesis_budget(edge_burst[0]);
		}
		openvlc_edge_bursts_decoded++;

		openvlc_edge_last_decode_status = (int32_t)decode_status;
		if (decode_status == OPENVLC_OK) {
			openvlc_edge_last_ok_burst_len = edge_burst_len;
		} else {
			openvlc_edge_last_fail_burst_len = edge_burst_len;
		}
#if OPENVLC_RX_CAPTURE
		/*
		 * Startup qualification is deliberately separate from sampling.
		 * Once the receiver has produced a clean run, later link errors do
		 * not make us reclassify normal traffic as startup transients.
		 */
		if (!rx_capture_qualified) {
			if (decode_status == OPENVLC_OK) {
				if (rx_capture_warmup_ok <
				    OPENVLC_RX_CAPTURE_ARM_AFTER_OK)
					rx_capture_warmup_ok++;
				if (rx_capture_warmup_ok >=
				    OPENVLC_RX_CAPTURE_ARM_AFTER_OK) {
					rx_capture_qualified = true;
					rx_capture_frame_gap = 0u;
				}
			}
		} else if (rx_capture_state == RX_CAPTURE_ARMED &&
			   !rx_capture_all_quotas_full()) {
			if (rx_capture_frame_gap < UINT32_MAX)
				rx_capture_frame_gap++;
			if (decode_status != OPENVLC_OK &&
			    rx_capture_frame_gap >=
				    OPENVLC_RX_CAPTURE_MIN_FRAME_GAP)
				rx_capture_snapshot(decode_status, false);
			else if (decode_status == OPENVLC_OK &&
				 rx_capture_frame_gap >=
					 OPENVLC_RX_CAPTURE_OK_FRAME_GAP)
				rx_capture_snapshot(decode_status, true);
		}
#endif
#if defined(STM32H743xx) || defined(STM32H723xx)
		if (!reuse_soft_failure) {
			openvlc_decode_last_ticks =
				__HAL_TIM_GET_COUNTER(&htim2) - decode_start;
			if (openvlc_decode_last_ticks > openvlc_decode_max_ticks)
				openvlc_decode_max_ticks = openvlc_decode_last_ticks;
		}
#endif
	} else if (!final_boundary) {
		return false;
	} else if (!edge_burst_overflowed && edge_burst_len > 1u) {
		openvlc_edge_short_bursts++;
		openvlc_edge_last_short_burst_len = edge_burst_len;
	}
	if (!consumed)
		return false;

	openvlc_edge_last_raw_burst_len = raw_burst_len;
	openvlc_edge_last_burst_len = edge_burst_len;
	if (edge_burst_len > openvlc_edge_max_burst)
		openvlc_edge_max_burst = edge_burst_len;
#if OPENVLC_COMP_RUN_ANALYSIS
	if (!edge_burst_overflowed &&
	    ++edge_run_diag_phase >= OPENVLC_COMP_RUN_DIAG_DECIMATION) {
		edge_run_diag_phase = 0u;
		edge_analyze_burst_runs();
	}
#endif
#if OPENVLC_BURST_TRACE
	if (edge_burst_len >= 16u)
		openvlc_platform_log("BURST len=%lu endgap_us=%lu st=%ld syncs=%lu prerej=%lu\r\n",
				     (unsigned long)edge_burst_len,
				     (unsigned long)(edge_burst_end_gap /
						     (OPENVLC_TIM2_IC_TICK_HZ / 1000000u)),
				     (long)openvlc_app_last_status(),
				     (unsigned long)openvlc_phy_dbg_sfdsync_syncs,
				     (unsigned long)openvlc_phy_dbg_sfdsync_pre_rejects);
#endif
	edge_burst_len = 0;
	edge_burst_raw_len = 0;
	edge_burst_overflowed = false;
	edge_have_last = false;
	edge_soft_gap_checked = false;
	edge_burst_end_gap = 0;
#if OPENVLC_RX_CAPTURE
	if (rx_capture_state == RX_CAPTURE_ARMED)
		rx_capture_prepared = false;
#endif
	return true;
}

int openvlc_stm32_rx_comparator_start(void)
{
#if defined(STM32H743xx) || defined(STM32H723xx)
	openvlc_comp_start_step = 1u;
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R,
			 OPENVLC_COMP_THRESHOLD_DAC);
	if (HAL_DAC_Start(&hdac1, DAC_CHANNEL_1) != HAL_OK)
		return -1;
	openvlc_comp_start_step = 2u;
	if (HAL_COMP_Start(&hcomp1) != HAL_OK)
		return -2;
	openvlc_comp_start_step = 3u;
	/*
	 * Brief analog-path self-test. It runs before capture, checks COMP1 at
	 * both DAC rails, and restores the configured receive threshold.
	 */
	if (HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, 0u) != HAL_OK)
		return -5;
	HAL_Delay(2u);
	openvlc_comp_test_zero_dor = DAC1->DOR1 & DAC_DOR1_DACC1DOR;
	openvlc_comp_test_zero_high = comp_count_high_samples();
	if (HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, 4095u) != HAL_OK)
		return -6;
	HAL_Delay(2u);
	openvlc_comp_test_full_dor = DAC1->DOR1 & DAC_DOR1_DACC1DOR;
	openvlc_comp_test_full_high = comp_count_high_samples();
	if (HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R,
			     OPENVLC_COMP_THRESHOLD_DAC) != HAL_OK)
		return -7;
	HAL_Delay(2u);
	if (HAL_TIMEx_TISelection(&htim2, TIM_TIM2_TI4_COMP1,
				  TIM_CHANNEL_4) != HAL_OK)
		return -3;
	openvlc_comp_start_step = 4u;
	/*
	 * This RX path is polled: DMA writes the circular capture ring and the
	 * main loop reads NDTR. HAL_TIM_IC_Start_DMA enables DMA interrupts, but
	 * we do not consume HT/TC callbacks here; at optical edge rates they can
	 * fault before the first main-loop poll. Keep the stream running, disable
	 * its IRQ sources, and poll the ring explicitly.
	 */
	if (edge_capture_start_dma() != 0)
		return -4;
	openvlc_comp_start_step = 5u;
	openvlc_comp_last_level =
		(COMP12->SR & COMP_SR_C1VAL) != 0u ? 1u : 0u;
	openvlc_comp_level_valid = true;
	openvlc_comp_start_step = 6u;
#endif
	edge_burst_len = 0;
	edge_burst_raw_len = 0;
	edge_burst_overflowed = false;
	edge_have_last = false;
	edge_sync_to_gap = false;
	edge_soft_gap_checked = false;
	edge_previous_burst_start = 0u;
	edge_filtered_period_ticks = 0u;
	edge_period_valid = false;
	openvlc_rx_last_decode_budget = 0u;
	return 0;
}

OPENVLC_RX_HOT void openvlc_stm32_rx_comparator_poll(void)
{
#if OPENVLC_RX_DEEP_DEBUG_LOG
	uint32_t comp_level;
#endif
	uint32_t head = edge_dma_head();
	uint32_t backlog;
#if OPENVLC_RX_DIAG_LOG
	uint32_t processed_edges = 0u;
#endif

	if (!edge_capture_running)
		return;
#if defined(STM32H743xx) || defined(STM32H723xx)
	/* CC4OF means a new comparator edge arrived before DMA consumed CCR4.
	 * Unlike the software burst/ring counters, this directly exposes DMA
	 * starvation or bus contention. The flag is sticky until software clears it. */
	if ((TIM2->SR & TIM_SR_CC4OF) != 0u) {
		openvlc_edge_hw_overcaptures++;
		__HAL_TIM_CLEAR_FLAG(&htim2, TIM_FLAG_CC4OF);
	}
#if OPENVLC_RX_DEEP_DEBUG_LOG
	/* Independent probe of COMP1_OUT, before the TIM2 input mux and DMA. */
	comp_level = (COMP12->SR & COMP_SR_C1VAL) != 0u ? 1u : 0u;
	openvlc_comp_level_samples++;
	if (openvlc_comp_level_valid && comp_level != openvlc_comp_last_level)
		openvlc_comp_level_changes++;
	openvlc_comp_last_level = comp_level;
	openvlc_comp_level_valid = true;
#endif
#endif
	/* Ring backlog watermark: detect how close we get to a silent wrap. */
	backlog = head >= edge_dma_tail ? head - edge_dma_tail :
		  OPENVLC_EDGE_DMA_LEN - edge_dma_tail + head;
#if OPENVLC_RX_DIAG_LOG
	if (backlog > openvlc_edge_ring_peak)
		openvlc_edge_ring_peak = backlog;
#endif
	/*
	 * A damaged frame must not consume enough CPU to overflow the capture
	 * ring. This pressure/TX limit is combined at burst flush with the stricter
	 * start-to-start cadence deadline, which protects a continuous stream even
	 * when backlog is still low at poll entry.
	 */
	if (backlog > OPENVLC_EDGE_DMA_LEN / 8u)
		openvlc_rx_hypothesis_budget = 1u;
	else if (openvlc_stm32_tx_busy() ||
		 openvlc_stm32_tx_pipeline_depth() != 0u)
		openvlc_rx_hypothesis_budget = 2u;
	else
		openvlc_rx_hypothesis_budget = 0u;
	/*
	 * Congestion-collapse guard. Past 3/4 of the ring a silent wrap is
	 * imminent (or already happened): the oldest edges - the preamble of
	 * the burst being assembled - get overwritten, every decode then fails,
	 * and failed bursts cost more than good ones, so the backlog never
	 * drains on its own. Drop the whole backlog, resync to the next burst
	 * gap, and pay a couple of lost frames instead of a dead link.
	 */
	if (backlog > (OPENVLC_EDGE_DMA_LEN / 4u) * 3u) {
		edge_dma_tail = head;
		edge_burst_len = 0;
		edge_burst_raw_len = 0;
		edge_burst_overflowed = false;
		edge_have_last = false;
		edge_sync_to_gap = true;
		edge_soft_gap_checked = false;
		openvlc_edge_ring_drops++;
		return;
	}
#if OPENVLC_RX_DEEP_DEBUG_LOG
	openvlc_comp_poll_step = 1u;
	openvlc_comp_poll_head = head;
	openvlc_comp_poll_tail = edge_dma_tail;
	openvlc_comp_poll_burst_len = edge_burst_len;
#endif
	while (edge_dma_tail != head) {
		uint32_t t = edge_dma_buf[edge_dma_tail];
#if OPENVLC_RX_RAW_INTERVAL_HIST
		uint32_t raw_interval = edge_have_last ?
			t - edge_last_tick : UINT32_MAX;
#endif
		bool yield_after_edge = false;

#if OPENVLC_RX_DEEP_DEBUG_LOG
		openvlc_comp_poll_step = 2u;
#endif
		if (++edge_dma_tail >= OPENVLC_EDGE_DMA_LEN)
			edge_dma_tail = 0;
#if OPENVLC_RX_DIAG_LOG
		processed_edges++;
#endif
#if OPENVLC_RX_DEEP_DEBUG_LOG
		openvlc_comp_poll_tail = edge_dma_tail;
#endif
		if (edge_sync_to_gap) {
			if (edge_have_last &&
			    (t - edge_last_tick) > OPENVLC_EDGE_GAP_TICKS) {
				edge_sync_to_gap = false;
				edge_soft_gap_checked = false;
				edge_burst_len = 0;
				edge_burst_raw_len = 1u;
				edge_burst_overflowed = false;
				edge_burst[edge_burst_len++] = t;
#if OPENVLC_RX_DEEP_DEBUG_LOG
				openvlc_comp_poll_burst_len = edge_burst_len;
#endif
			}
			edge_last_tick = t;
			edge_have_last = true;
			continue;
		}
		if (edge_have_last &&
		    (t - edge_last_tick) > OPENVLC_EDGE_GAP_TICKS) {
			uint32_t gap = t - edge_last_tick;

