lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
			openvlc_edge_gaps_seen++;
			uint32_t decoded_before = openvlc_edge_bursts_decoded;
			bool consumed = false;
			bool hard_boundary =
				gap > OPENVLC_EDGE_HARD_GAP_TICKS;

			/*
			 * The candidate gap is completion-driven: a CRC/RS-valid packet
			 * is delivered immediately, while an incomplete prefix survives
			 * until the hard gap. This is the useful property of a continuous
			 * interval decoder without removing our validated frame parser.
			 */
			edge_burst_end_gap = gap;
#if OPENVLC_EDGE_HARD_GAP_US > OPENVLC_EDGE_GAP_US
			if (hard_boundary) {
				if (edge_burst_len >= OPENVLC_FRAG_MIN_EDGES &&
				    edge_burst_len < OPENVLC_FRAG_MAX_EDGES) {
					openvlc_frag_count++;
					openvlc_frag_last_at = edge_burst_len;
					openvlc_frag_last_gap_ticks = gap;
				}
				consumed = edge_flush_burst(true);
			}
#if !OPENVLC_RX_CAPTURE
			else if (!edge_soft_gap_checked) {
				bool attempted = !edge_burst_overflowed &&
					edge_burst_len >= OPENVLC_RX_MIN_DECODE_EDGES;

				consumed = edge_flush_burst(false);
				if (!consumed && attempted) {
					edge_soft_gap_checked = true;
					openvlc_edge_soft_gap_bridged++;
				}
			} else {
				/* The idle-time poll already rejected this prefix. */
				openvlc_edge_soft_gap_bridged++;
			}
#endif
#else
			(void)hard_boundary;
			if (edge_burst_len >= OPENVLC_FRAG_MIN_EDGES &&
			    edge_burst_len < OPENVLC_FRAG_MAX_EDGES) {
				openvlc_frag_count++;
				openvlc_frag_last_at = edge_burst_len;
				openvlc_frag_last_gap_ticks = gap;
			}
			consumed = edge_flush_burst(true);
#endif
			yield_after_edge =
				openvlc_edge_bursts_decoded != decoded_before;
			if (!consumed)
				edge_soft_gap_checked = false;
		}
		if (edge_burst_overflowed) {
			edge_last_tick = t;
			edge_have_last = true;
			continue;
		}
#if OPENVLC_RX_DEEP_DEBUG_LOG
		openvlc_comp_poll_step = 3u;
#endif
		edge_burst_raw_len++;
#if OPENVLC_RX_RAW_INTERVAL_HIST
		/*
		 * One comparison is paid by every edge. Only genuinely short
		 * intervals enter the bin chain and write RAM. Inter-frame gaps and
		 * normal 30/34-tick cells therefore add no counter-write pressure.
		 */
		if (raw_interval < 24u) {
			uint32_t bin;

			if (raw_interval < 8u)
				bin = 0u;
			else if (raw_interval < 12u)
				bin = 1u;
			else if (raw_interval < 16u)
				bin = 2u;
			else if (raw_interval < 20u)
				bin = 3u;
			else
				bin = 4u;
			openvlc_edge_raw_short_hist[bin]++;
		}
#endif
		/* Preserve raw edges; filtering runs once with packet-local context. */
		if (edge_burst_len >= OPENVLC_EDGE_BURST_LEN) {
			openvlc_edge_overflows++;
			/*
			 * Decode what was captured rather than discarding the burst.
			 *
			 * The payload sits at the FRONT of edge_burst[]; what overflows the end is
			 * trailing idle. Throwing the whole burst away on overflow discards a frame
			 * that is already in hand, then resyncs at the next real gap anyway.
			 *
			 * This cannot deliver a corrupt packet: a genuinely truncated burst still
			 * fails CRC and RS exactly as before. Enlarging the buffer instead would
			 * only move the cliff - it is already 64 KB.
			 */
			(void)edge_flush_burst(true);
			edge_sync_to_gap = true;
			edge_soft_gap_checked = false;
			edge_last_tick = t;
			edge_have_last = true;
			continue;
		}
		edge_burst[edge_burst_len++] = t;
#if OPENVLC_RX_DEEP_DEBUG_LOG
		openvlc_comp_poll_burst_len = edge_burst_len;
#endif
		edge_last_tick = t;
		edge_have_last = true;
		/*
		 * Full-duplex fairness: never decode two completed packet-sized
		 * bursts in one foreground visit. A second synchronous decode can
		 * keep the host parser and TX slot refill asleep for 10-17 ms, burst
		 * the UART queue and let TIM2 reach its 3/4-ring guard. The current
		 * edge has already been preserved as the head of the next burst, so
		 * returning here is lossless; the next main-loop iteration resumes at
		 * edge_dma_tail after servicing UART/TX.
		 */
		if (yield_after_edge) {
#if OPENVLC_RX_DIAG_LOG
			openvlc_edge_total += processed_edges;
#endif
#if OPENVLC_RX_DEEP_DEBUG_LOG
			openvlc_comp_poll_step = 4u;
#endif
			return;
		}
	}

	/*
	 * Finalize a burst as soon as the configured idle interval has elapsed,
	 * rather than waiting for the first edge of the NEXT frame to reveal the
	 * gap. Waiting wastes the whole inter-frame idle and starts synchronous
	 * decoding while the following packet is already entering the DMA ring. TIM2 is free-running, so this timeout is precise
	 * to one foreground poll and also delivers the final packet when TX stops.
	 */
#if (defined(STM32H743xx) || defined(STM32H723xx)) && \
	OPENVLC_RX_IDLE_TIMEOUT_FLUSH
	if (!edge_sync_to_gap && edge_have_last &&
	    (edge_burst_len != 0u || edge_burst_overflowed)) {
		uint32_t idle_head = edge_dma_head();

		/*
		 * `head` above is only the snapshot taken on function entry. At
		 * 1.6 Medges/s DMA can append several transitions while that snapshot
		 * is being drained. Comparing the free-running timer with the last
		 * CONSUMED edge in that situation falsely reports an idle gap and
		 * splits a live packet. Finalize only when a fresh DMA-head sample
		 * proves that the ring is empty, then verify it once more after
		 * sampling the timer to close the DMA/CPU race.
		 */
		if (idle_head == edge_dma_tail) {
			uint32_t idle_ticks =
				__HAL_TIM_GET_COUNTER(&htim2) - edge_last_tick;

			__DMB();
			if (idle_ticks > OPENVLC_EDGE_GAP_TICKS &&
			    edge_dma_head() == edge_dma_tail) {
				edge_burst_end_gap = idle_ticks;
#if OPENVLC_EDGE_HARD_GAP_US > OPENVLC_EDGE_GAP_US
				if (idle_ticks > OPENVLC_EDGE_HARD_GAP_TICKS) {
					if (edge_burst_len >= OPENVLC_FRAG_MIN_EDGES &&
					    edge_burst_len < OPENVLC_FRAG_MAX_EDGES) {
						openvlc_frag_count++;
						openvlc_frag_last_at = edge_burst_len;
						openvlc_frag_last_gap_ticks = idle_ticks;
					}
					(void)edge_flush_burst(true);
				}
#if !OPENVLC_RX_CAPTURE
				else if (!edge_soft_gap_checked) {
					bool attempted = !edge_burst_overflowed &&
						edge_burst_len >=
							OPENVLC_RX_MIN_DECODE_EDGES;

					if (!edge_flush_burst(false) && attempted)
						edge_soft_gap_checked = true;
				}
#endif
#else
				if (edge_burst_len >= OPENVLC_FRAG_MIN_EDGES &&
				    edge_burst_len < OPENVLC_FRAG_MAX_EDGES) {
					openvlc_frag_count++;
					openvlc_frag_last_at = edge_burst_len;
					openvlc_frag_last_gap_ticks = idle_ticks;
				}
				(void)edge_flush_burst(true);
#endif
			}
		}
	}
#endif
#if OPENVLC_RX_DEEP_DEBUG_LOG
	openvlc_comp_poll_step = 4u;
#endif
#if OPENVLC_RX_DIAG_LOG
	openvlc_edge_total += processed_edges;
#endif

