lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
}
void openvlc_stm32_init(void)
{
	openvlc_runtime_config_t cfg = {
		.self_id = OPENVLC_ADDR_SELF_DEFAULT,
		.peer_id = OPENVLC_ADDR_PEER_DEFAULT,
		.line_code = OPENVLC_LINE_CODE,
		.samples_per_symbol = OPENVLC_SAMPLES_PER_SYMBOL,
		.mf_score_min = OPENVLC_MF_SCORE_MIN,
		.snr_min_db_centi = OPENVLC_SNR_MIN_DB_CENTI,
	};

	openvlc_app_init(&cfg);
	memset(&openvlc_last_quality, 0, sizeof(openvlc_last_quality));
	openvlc_last_quality_valid = 0u;
#if (defined(STM32H743xx) || defined(STM32H723xx)) && OPENVLC_RX_HOST_FORWARD
	/* Host UART DMA completion and RX error/timeout handling. */
	HAL_NVIC_SetPriority(USART3_IRQn, 6u, 0u);
	HAL_NVIC_EnableIRQ(USART3_IRQn);
#endif
	openvlc_platform_log("OpenVLC STM32 init: node=%u phy=%u>%u line=%u preamble=%u rate=%uk tx_budget=%u tx_cell=%u rs=%u COMP1_PB0 threshold_dac=%u hyst=%u tim2_ic=%luHz gap_us=%u/%u edgefilter=%u gate=%u hard=%u timingmin=%u host=%u baud=%lu icache=%u rxlocal=%u capture=%u capraw=%u capok=%u capfail=%u caparm=%u capgap=%u/%u capmin=%u\r\n",
			     (unsigned int)OPENVLC_TRANSCEIVER_NODE,
			     (unsigned int)OPENVLC_TX_SRC_ADDR,
			     (unsigned int)OPENVLC_TX_DST_ADDR,
			     cfg.line_code, (unsigned int)OPENVLC_PREAMBLE_BYTES,
			     (unsigned int)OPENVLC_PHY_RATE_KBPS,
			     (unsigned int)OPENVLC_STM32_TX_PROFILE_BUDGET,
			     (unsigned int)OPENVLC_STM32_TX_CELL_TICKS,
			     (unsigned int)OPENVLC_BEAGLEBONE_RS_ECC_BYTES,
			     (unsigned int)OPENVLC_COMP_THRESHOLD_DAC,
			     (unsigned int)OPENVLC_COMP_HYSTERESIS_LEVEL,
			     (unsigned long)OPENVLC_TIM2_IC_TICK_HZ,
			     (unsigned int)OPENVLC_EDGE_GAP_US,
			     (unsigned int)OPENVLC_EDGE_HARD_GAP_US,
			     (unsigned int)OPENVLC_RX_EDGE_FILTER_MODE,
			     (unsigned int)OPENVLC_EDGE_MIN_INTERVAL_TICKS,
			     (unsigned int)OPENVLC_EDGE_HARD_GLITCH_TICKS,
			     (unsigned int)OPENVLC_COMP_MIN_HALFCELL_TICKS,
			     (unsigned int)OPENVLC_RX_HOST_FORWARD,
			     (unsigned long)OPENVLC_HOST_UART_BAUD,
			     (unsigned int)((SCB->CCR & SCB_CCR_IC_Msk) != 0u),
			     (unsigned int)OPENVLC_RX_LOCAL_TIMING,
			     (unsigned int)OPENVLC_RX_CAPTURE,
			     (unsigned int)OPENVLC_RX_CAPTURE_RAW,
			     (unsigned int)OPENVLC_RX_CAPTURE_MAX_SUCCESSES,
			     (unsigned int)OPENVLC_RX_CAPTURE_MAX_FAILURES,
			     (unsigned int)OPENVLC_RX_CAPTURE_ARM_AFTER_OK,
			     (unsigned int)OPENVLC_RX_CAPTURE_MIN_FRAME_GAP,
			     (unsigned int)OPENVLC_RX_CAPTURE_OK_FRAME_GAP,
			     (unsigned int)OPENVLC_RX_CAPTURE_MIN_EDGES);
}

int openvlc_stm32_start(void)
{
	/* Comparator + TIM2 input-capture receiver. */
	openvlc_stm32_start_step = 1u;
	if (openvlc_stm32_rx_comparator_start() != 0)
		return -10;
	openvlc_stm32_start_step = 3u;
	return 0;
}

#if OPENVLC_COMP_THRESHOLD_AUTO && \
	(defined(STM32H743xx) || defined(STM32H723xx))
static uint32_t comp_auto_current_threshold = OPENVLC_COMP_THRESHOLD_DAC;

static uint32_t comp_auto_clamp_threshold(uint32_t threshold)
{
	if (threshold < OPENVLC_COMP_AUTO_MIN)
		return OPENVLC_COMP_AUTO_MIN;
	if (threshold > OPENVLC_COMP_AUTO_MAX)
		return OPENVLC_COMP_AUTO_MAX;
	return threshold;
}

static void comp_auto_apply_threshold(uint32_t threshold)
{
	threshold = comp_auto_clamp_threshold(threshold);
	if (HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R,
			     threshold) != HAL_OK)
		return;
	comp_auto_current_threshold = threshold;

	/*
	 * Changing the analog slicer threshold in the middle of a burst can
	 * create one artificial edge. Drop the partial burst and restart at the
	 * next idle gap so the threshold search scores complete frames only.
	 */
	edge_burst_len = 0u;
	edge_burst_raw_len = 0u;
	edge_burst_overflowed = false;
	edge_have_last = false;
	edge_sync_to_gap = true;
	edge_soft_gap_checked = false;
}

static int32_t comp_auto_score(uint32_t bursts, uint32_t ok,
			       uint32_t glitches, uint32_t long_gaps)
{
	uint32_t glitch_per_burst;
	uint32_t long_per_burst;
	int32_t score;

	if (!bursts)
		return -2000000000;

	/*
	 * Tune for packet quality, not just activity.
	 *
	 * On the Pi HAT comparator path a poor threshold often still produces a
	 * plausible number of bursts but loses SFD/sync on a few percent of them.
	 * A delivered frame already proves preamble, SFD, length and RS/CRC, so its
	 * delivered-frame count is the authoritative metric because every candidate
	 * has the same dwell time. Do not divide it by the detected burst count:
	 * with a marginal slicer, one optical frame may be split into several
	 * fragments, which made the old ratio prefer 10/184 over 18/625 even though
	 * the latter threshold delivered almost twice as much useful traffic.
	 * Glitch and long-run counts are payload dependent; retain them only as
	 * bounded tie-breakers that cannot outweigh one additional valid frame.
	 */
	glitch_per_burst = glitches / bursts;
	long_per_burst = long_gaps / bursts;
	if (glitch_per_burst > 100u)
		glitch_per_burst = 100u;
	if (long_per_burst > 100u)
		long_per_burst = 100u;
	score = (int32_t)(ok * 100000u);
	score -= (int32_t)glitch_per_burst;
	score -= (int32_t)(long_per_burst * 2u);
	return score;
}

static void comp_auto_threshold_poll(uint32_t now_ms,
				     const openvlc_counters_t *cc)
{
	enum {
		AUTO_IDLE = 0,
		AUTO_SCAN = 1,
		AUTO_LOCKED = 2,
	};
	static uint8_t state;
	static bool initialized;
	static uint32_t candidate_thr;
	static uint32_t best_thr;
	static int32_t best_score;
	static uint32_t mark_ms;
	static uint32_t mark_bursts;
	static uint32_t mark_ok;
	static uint32_t mark_crc;
	static uint32_t mark_sync;
	static uint32_t mark_glitch;
	static uint32_t mark_long;
	static uint32_t mark_fail_timing;
	static uint32_t mark_fail_no_sfd;
	static uint32_t mark_fail_preamble;
	static uint32_t mark_fail_parse;
	static uint32_t no_ok_activity_s;
	static uint32_t bad_quality_s;
	static uint32_t last_good_ms;
	uint32_t now_bursts = openvlc_edge_bursts_decoded;
	uint32_t now_ok = cc ? cc->frames_delivered : 0u;
	uint32_t now_crc = cc ? cc->crc_failed : 0u;
	uint32_t now_sync = cc ? cc->sync_failed : 0u;
	uint32_t dwell_ms = OPENVLC_COMP_AUTO_DWELL_S * 1000u;

