lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
#if !OPENVLC_RX_DIAG_LOG
	/*
	 * Keep the diagnostic marks state-compatible with a logging build while
	 * making their intentionally write-only role explicit to -Wall.
	 */
	(void)mark_crc;
	(void)mark_sync;
	(void)mark_fail_timing;
	(void)mark_fail_no_sfd;
	(void)mark_fail_preamble;
	(void)mark_fail_parse;
#endif

	if (!initialized) {
		initialized = true;
		state = AUTO_IDLE;
		comp_auto_apply_threshold(OPENVLC_COMP_THRESHOLD_DAC);
		last_good_ms = now_ms;
	}

	if (state == AUTO_SCAN) {
		if (now_ms - mark_ms >= dwell_ms) {
			uint32_t bursts = now_bursts - mark_bursts;
			uint32_t ok = now_ok - mark_ok;
#if OPENVLC_RX_DIAG_LOG
			uint32_t crc = now_crc - mark_crc;
			uint32_t sync = now_sync - mark_sync;
#endif
			uint32_t glitches = openvlc_edge_glitches - mark_glitch;
			uint32_t long_gaps = openvlc_edge_long_total - mark_long;
#if OPENVLC_RX_DIAG_LOG
			uint32_t fail_timing =
				openvlc_phy_dbg_sfdsync_fail_timing -
				mark_fail_timing;
			uint32_t fail_no_sfd =
				openvlc_phy_dbg_sfdsync_fail_no_sfd -
				mark_fail_no_sfd;
			uint32_t fail_preamble =
				openvlc_phy_dbg_sfdsync_fail_preamble -
				mark_fail_preamble;
			uint32_t fail_parse =
				openvlc_phy_dbg_sfdsync_fail_parse -
				mark_fail_parse;
#endif
			int32_t score = comp_auto_score(bursts, ok, glitches,
							long_gaps);

			if (score > best_score) {
				best_score = score;
				best_thr = candidate_thr;
			}

#if OPENVLC_RX_DIAG_LOG
			openvlc_platform_log(
				"COMP AUTO scan thr=%lu thr_mv=%lu bursts=%lu ok=%lu crc=%lu sync=%lu glitch=%lu long=%lu ft=%lu fn=%lu fp=%lu fx=%lu score=%ld best=%lu best_mv=%lu\r\n",
				(unsigned long)candidate_thr,
				(unsigned long)OPENVLC_DAC_TO_MV(candidate_thr),
				(unsigned long)bursts,
				(unsigned long)ok,
				(unsigned long)crc,
				(unsigned long)sync,
				(unsigned long)glitches,
				(unsigned long)long_gaps,
				(unsigned long)fail_timing,
				(unsigned long)fail_no_sfd,
				(unsigned long)fail_preamble,
				(unsigned long)fail_parse,
				(long)score,
				(unsigned long)best_thr,
				(unsigned long)OPENVLC_DAC_TO_MV(best_thr));
#endif

			if (candidate_thr + OPENVLC_COMP_AUTO_STEP >
			    OPENVLC_COMP_AUTO_MAX) {
				if (best_score <= -2000000000)
					best_thr = comp_auto_clamp_threshold(
						OPENVLC_COMP_THRESHOLD_DAC);
				comp_auto_apply_threshold(best_thr);
				state = AUTO_LOCKED;
				no_ok_activity_s = 0u;
				bad_quality_s = 0u;
				last_good_ms = now_ms;
				mark_ms = now_ms;
				mark_bursts = now_bursts;
				mark_ok = now_ok;
				mark_crc = now_crc;
				mark_sync = now_sync;
				mark_glitch = openvlc_edge_glitches;
				mark_long = openvlc_edge_long_total;
				mark_fail_timing =
					openvlc_phy_dbg_sfdsync_fail_timing;
				mark_fail_no_sfd =
					openvlc_phy_dbg_sfdsync_fail_no_sfd;
				mark_fail_preamble =
					openvlc_phy_dbg_sfdsync_fail_preamble;
				mark_fail_parse =
					openvlc_phy_dbg_sfdsync_fail_parse;
#if OPENVLC_RX_DIAG_LOG
				openvlc_platform_log(
					"COMP AUTO lock thr=%lu thr_mv=%lu score=%ld\r\n",
					(unsigned long)best_thr,
					(unsigned long)OPENVLC_DAC_TO_MV(best_thr),
					(long)best_score);
#endif
				return;
			}

			candidate_thr += OPENVLC_COMP_AUTO_STEP;
			comp_auto_apply_threshold(candidate_thr);
			mark_ms = now_ms;
			mark_bursts = now_bursts;
			mark_ok = now_ok;
			mark_crc = now_crc;
			mark_sync = now_sync;
			mark_glitch = openvlc_edge_glitches;
			mark_long = openvlc_edge_long_total;
			mark_fail_timing =
				openvlc_phy_dbg_sfdsync_fail_timing;
			mark_fail_no_sfd =
				openvlc_phy_dbg_sfdsync_fail_no_sfd;
			mark_fail_preamble =
				openvlc_phy_dbg_sfdsync_fail_preamble;
			mark_fail_parse =
				openvlc_phy_dbg_sfdsync_fail_parse;
		}
		return;
	}

	{
	uint32_t window_ms = now_ms - mark_ms;
	uint32_t window_bursts = now_bursts - mark_bursts;
	uint32_t window_ok = now_ok - mark_ok;
#if OPENVLC_RX_DIAG_LOG
	uint32_t window_long = openvlc_edge_long_total - mark_long;
#endif

	/*
	 * This control function runs on every foreground-loop visit. Evaluate a
	 * locked threshold only once per real one-second window; otherwise the
	 * marks are refreshed every few microseconds, window_bursts remains zero,
	 * and poor quality can never trigger a rescan.
	 */
	if (state == AUTO_LOCKED && window_ms < 1000u)
		return;

	if (window_ok) {
		last_good_ms = now_ms;
		no_ok_activity_s = 0u;
	} else if (window_bursts && window_ms >= 1000u) {
		no_ok_activity_s++;
	}

	if (state == AUTO_IDLE) {
		if (now_bursts == 0u) {
			mark_ms = now_ms;
			mark_bursts = now_bursts;
			mark_ok = now_ok;
			mark_crc = now_crc;
			mark_sync = now_sync;
			mark_glitch = openvlc_edge_glitches;
			mark_long = openvlc_edge_long_total;
			mark_fail_timing =
				openvlc_phy_dbg_sfdsync_fail_timing;
			mark_fail_no_sfd =
				openvlc_phy_dbg_sfdsync_fail_no_sfd;
			mark_fail_preamble =
				openvlc_phy_dbg_sfdsync_fail_preamble;
			mark_fail_parse =
				openvlc_phy_dbg_sfdsync_fail_parse;
			return;
		}
	} else if (state == AUTO_LOCKED) {
		uint32_t ok_ppm = window_bursts ?
			(uint32_t)(((uint64_t)window_ok * 1000000u) /
				   window_bursts) :
			1000000u;
		bool poor_ok =
			window_bursts >= 20u &&
			ok_ppm < OPENVLC_COMP_AUTO_RESCAN_MIN_OK_PPM;
		bool bad_for_too_long =
			no_ok_activity_s >= OPENVLC_COMP_AUTO_RESCAN_BAD_S;
		bool bad_quality_for_too_long;
		bool periodic =
			OPENVLC_COMP_AUTO_PERIODIC_RESCAN_S &&
			now_ms - last_good_ms >=
				OPENVLC_COMP_AUTO_PERIODIC_RESCAN_S * 1000u;

		/* Long-run counts depend on the transmitted payload and are not a
		 * reason to disturb an otherwise valid link. Rescan only from the
		 * end-to-end decoder success ratio (or complete loss of activity). */
		if (poor_ok)
			bad_quality_s++;
		else
			bad_quality_s = 0u;
		bad_quality_for_too_long =
			bad_quality_s >= OPENVLC_COMP_AUTO_RESCAN_QUALITY_BAD_S;

		if (!bad_for_too_long && !bad_quality_for_too_long &&
		    !periodic) {
			mark_ms = now_ms;
			mark_bursts = now_bursts;
			mark_ok = now_ok;
			mark_crc = now_crc;
			mark_sync = now_sync;
			mark_glitch = openvlc_edge_glitches;
			mark_long = openvlc_edge_long_total;
			mark_fail_timing =
				openvlc_phy_dbg_sfdsync_fail_timing;
			mark_fail_no_sfd =
				openvlc_phy_dbg_sfdsync_fail_no_sfd;
			mark_fail_preamble =
				openvlc_phy_dbg_sfdsync_fail_preamble;
			mark_fail_parse =
				openvlc_phy_dbg_sfdsync_fail_parse;
			return;
		}

