lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
#if OPENVLC_RX_DIAG_LOG
		openvlc_platform_log(
			"COMP AUTO rescan reason=%lu okppm=%lu long=%lu bursts=%lu badq=%lu thr=%lu thr_mv=%lu\r\n",
			(unsigned long)(bad_for_too_long ? 1u :
					(bad_quality_for_too_long ? 2u : 3u)),
			(unsigned long)ok_ppm,
			(unsigned long)window_long,
			(unsigned long)window_bursts,
			(unsigned long)bad_quality_s,
			(unsigned long)comp_auto_current_threshold,
			(unsigned long)OPENVLC_DAC_TO_MV(
				comp_auto_current_threshold));
#endif
	}
	}

	state = AUTO_SCAN;
	candidate_thr = OPENVLC_COMP_AUTO_MIN;
	best_thr = comp_auto_clamp_threshold(OPENVLC_COMP_THRESHOLD_DAC);
	best_score = -2000000000;
	comp_auto_apply_threshold(candidate_thr);
	mark_ms = now_ms;
	mark_bursts = now_bursts;
	mark_ok = now_ok;
	mark_crc = now_crc;
	mark_sync = now_sync;
	mark_glitch = openvlc_edge_glitches;
	mark_long = openvlc_edge_long_total;
	mark_fail_timing = openvlc_phy_dbg_sfdsync_fail_timing;
	mark_fail_no_sfd = openvlc_phy_dbg_sfdsync_fail_no_sfd;
	mark_fail_preamble = openvlc_phy_dbg_sfdsync_fail_preamble;
	mark_fail_parse = openvlc_phy_dbg_sfdsync_fail_parse;
#if OPENVLC_RX_DIAG_LOG
	openvlc_platform_log("COMP AUTO start min=%lu min_mv=%lu max=%lu max_mv=%lu step=%lu step_mv=%lu dwell=%lus\r\n",
			     (unsigned long)OPENVLC_COMP_AUTO_MIN,
			     (unsigned long)OPENVLC_DAC_TO_MV(
				     OPENVLC_COMP_AUTO_MIN),
			     (unsigned long)OPENVLC_COMP_AUTO_MAX,
			     (unsigned long)OPENVLC_DAC_TO_MV(
				     OPENVLC_COMP_AUTO_MAX),
			     (unsigned long)OPENVLC_COMP_AUTO_STEP,
			     (unsigned long)OPENVLC_COMP_AUTO_STEP_MV,
			     (unsigned long)OPENVLC_COMP_AUTO_DWELL_S);
#endif
}
#endif

#if (defined(STM32H743xx) || defined(STM32H723xx)) && \
	(OPENVLC_RX_DIAG_LOG || OPENVLC_COMP_DUTY_SERVO)
/*
 * Windowed comparator duty for the diagnostic log and, when enabled, the
 * self-centering servo. Returns the duty over the elapsed window in per-mille,
 * or UINT32_MAX when there was not enough traffic to trust it. Advances the
 * caller's running marks.
 */
static uint32_t comp_duty_window(uint64_t *last_high, uint64_t *last_total)
{
	uint64_t high = openvlc_comp_duty_high_ticks - *last_high;
	uint64_t total = openvlc_comp_duty_total_ticks - *last_total;

	*last_high = openvlc_comp_duty_high_ticks;
	*last_total = openvlc_comp_duty_total_ticks;
	if (total < OPENVLC_COMP_DUTY_MIN_TICKS)
		return UINT32_MAX;
	return (uint32_t)((high * 1000u) / total);
}

#if OPENVLC_COMP_DUTY_SERVO
static uint32_t comp_duty_servo_dac = OPENVLC_COMP_THRESHOLD_DAC;
/*
 * Inner loop target. duty=50% marks the signal DC mean, but the measured
 * impossible-run minimum can sit 1-2 threshold steps off centre because
 * comparator hysteresis and propagation are asymmetric, so the slow outer loop
 * below trims this target to minimise longps - the direct measure of lost
 * transitions - instead of holding the proxy at exactly 500.
 */
static uint32_t comp_duty_target = OPENVLC_COMP_DUTY_TARGET_PERMILLE;
static uint32_t comp_duty_trim_last_ms;
static uint32_t comp_duty_trim_mark_long;
static uint32_t comp_duty_trim_mark_bursts;
static uint32_t comp_duty_trim_prev_rate = UINT32_MAX;
static int32_t comp_duty_trim_dir = 1;
volatile uint32_t openvlc_comp_duty_target_now =
	OPENVLC_COMP_DUTY_TARGET_PERMILLE;

static void comp_duty_target_trim(uint32_t now_ms)
{
#if OPENVLC_COMP_DUTY_TRIM
	uint32_t elapsed = now_ms - comp_duty_trim_last_ms;
	uint32_t bursts;
	uint32_t rate;

	if (!comp_duty_trim_last_ms) {
		comp_duty_trim_last_ms = now_ms;
		comp_duty_trim_mark_long = openvlc_edge_long_total;
		comp_duty_trim_mark_bursts = openvlc_edge_bursts_decoded;
		return;
	}
	if (elapsed < OPENVLC_COMP_DUTY_TRIM_S * 1000u)
		return;
	bursts = openvlc_edge_bursts_decoded - comp_duty_trim_mark_bursts;
	if (bursts < 16u) {
		/* Not enough traffic to judge; restart the window. */
		comp_duty_trim_last_ms = now_ms;
		comp_duty_trim_mark_long = openvlc_edge_long_total;
		comp_duty_trim_mark_bursts = openvlc_edge_bursts_decoded;
		return;
	}
	/* Impossible runs per 1000 bursts: threshold-quality objective. */
	rate = (uint32_t)(((uint64_t)(openvlc_edge_long_total -
				      comp_duty_trim_mark_long) * 1000u) /
			  bursts);
	if (comp_duty_trim_prev_rate != UINT32_MAX &&
	    rate > comp_duty_trim_prev_rate)
		comp_duty_trim_dir = -comp_duty_trim_dir; /* got worse: reverse */
	comp_duty_trim_prev_rate = rate;
	if (comp_duty_trim_dir > 0) {
		if (comp_duty_target + OPENVLC_COMP_DUTY_TRIM_STEP <=
		    OPENVLC_COMP_DUTY_TRIM_MAX)
			comp_duty_target += OPENVLC_COMP_DUTY_TRIM_STEP;
		else
			comp_duty_trim_dir = -1;
	} else {
		if (comp_duty_target >= OPENVLC_COMP_DUTY_TRIM_MIN +
					OPENVLC_COMP_DUTY_TRIM_STEP)
			comp_duty_target -= OPENVLC_COMP_DUTY_TRIM_STEP;
		else
			comp_duty_trim_dir = 1;
	}
	openvlc_comp_duty_target_now = comp_duty_target;
#if OPENVLC_RX_DIAG_LOG
	openvlc_platform_log("COMP TRIM longrate=%lu target=%lu dir=%ld\r\n",
			     (unsigned long)rate,
			     (unsigned long)comp_duty_target,
			     (long)comp_duty_trim_dir);
#endif
	comp_duty_trim_last_ms = now_ms;
	comp_duty_trim_mark_long = openvlc_edge_long_total;
	comp_duty_trim_mark_bursts = openvlc_edge_bursts_decoded;
#else
	(void)now_ms;
#endif
}

static void comp_duty_servo_poll(uint32_t duty)
{
	static bool init;

	if (!init) {
		init = true;
		comp_duty_servo_dac = OPENVLC_COMP_THRESHOLD_DAC;
		HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R,
				 comp_duty_servo_dac);
		return;
	}
	if (duty == UINT32_MAX)
		return; /* not enough traffic this window */

	if (duty > comp_duty_target + OPENVLC_COMP_DUTY_DEADBAND) {
		/* Too much time HIGH -> threshold below the DC mean -> raise it. */
		if (comp_duty_servo_dac + OPENVLC_COMP_AUTO_STEP <=
		    OPENVLC_COMP_AUTO_MAX)
			comp_duty_servo_dac += OPENVLC_COMP_AUTO_STEP;
		else
			return;
	} else if (duty + OPENVLC_COMP_DUTY_DEADBAND < comp_duty_target) {
		if (comp_duty_servo_dac >=
		    OPENVLC_COMP_AUTO_MIN + OPENVLC_COMP_AUTO_STEP)
			comp_duty_servo_dac -= OPENVLC_COMP_AUTO_STEP;
		else
			return;
	} else {
		return; /* within deadband: hold */
	}
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R,
			 comp_duty_servo_dac);
}
#endif
#endif

