lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
/*
 * Threshold control is functional, not diagnostic. Keep it alive when text
 * logging is disabled; older code accidentally ran AUTO/servo only from the
 * diagnostic branch.
 */
static void openvlc_stm32_rx_control_poll(uint32_t now_ms)
{
#if OPENVLC_COMP_THRESHOLD_AUTO && \
	(defined(STM32H743xx) || defined(STM32H723xx))
	comp_auto_threshold_poll(now_ms, openvlc_app_counters());
#endif
#if OPENVLC_COMP_DUTY_SERVO && \
	(defined(STM32H743xx) || defined(STM32H723xx))
	static uint32_t last_control_ms;
	static uint64_t duty_last_high;
	static uint64_t duty_last_total;

	if ((now_ms - last_control_ms) >= OPENVLC_COMP_DUTY_SERVO_MS) {
		uint32_t duty;

		last_control_ms = now_ms;
		duty = comp_duty_window(&duty_last_high, &duty_last_total);
		comp_duty_target_trim(now_ms);
		comp_duty_servo_poll(duty);
	}
#else
	(void)now_ms;
#endif
}

void openvlc_stm32_debug_poll(uint32_t now_ms)
{
	openvlc_stm32_rx_control_poll(now_ms);
#if OPENVLC_RX_DIAG_LOG
	static uint32_t last_log_ms;
	static uint32_t previous_edges;
	static uint32_t previous_glitches;
	static uint32_t previous_long_gaps;
#if OPENVLC_RX_RAW_INTERVAL_HIST
	static uint32_t previous_raw_short[5];
#endif
	static uint32_t previous_bursts;
	static uint32_t previous_seen;
	static uint32_t previous_ok;
#if OPENVLC_RX_DEEP_DEBUG_LOG && \
	(defined(STM32H743xx) || defined(STM32H723xx))
	static uint32_t previous_comp_changes;
#endif
	const openvlc_counters_t *cc;
	uint32_t elapsed_ms;
	uint32_t edge_delta;
	uint32_t glitch_delta;
	uint32_t long_delta;
	uint32_t burst_delta;
	uint32_t seen_delta;
	uint32_t ok_delta;
	uint32_t edge_rate;
	uint32_t long_rate;
	uint32_t burst_rate;
	uint32_t seen_rate;
	uint32_t ok_rate;
	uint32_t glitch_permille;
#if OPENVLC_RX_RAW_INTERVAL_HIST
	uint32_t raw_short_rate[5];
	uint32_t raw_ge24_rate;
#endif
	uint32_t decode_last_us;
	uint32_t decode_max_us;
	uint32_t threshold_dac = OPENVLC_COMP_THRESHOLD_DAC;
#if OPENVLC_RX_DEEP_DEBUG_LOG && \
	(defined(STM32H743xx) || defined(STM32H723xx))
	uint32_t comp_level = 0u;
	uint32_t comp_change_delta = 0u;
	uint32_t comp_change_rate = 0u;
#endif
#if !OPENVLC_RX_HOST_FORWARD
	bool resume_capture = false;
#endif

	elapsed_ms = now_ms - last_log_ms;
	if (elapsed_ms < OPENVLC_RX_DIAG_LOG_PERIOD_MS)
		return;
	last_log_ms = now_ms;
	edge_delta = openvlc_edge_total - previous_edges;
	glitch_delta = openvlc_edge_glitches - previous_glitches;
	long_delta = openvlc_edge_long_total - previous_long_gaps;
	previous_edges = openvlc_edge_total;
	previous_glitches = openvlc_edge_glitches;
	previous_long_gaps = openvlc_edge_long_total;
	edge_rate = (uint32_t)(((uint64_t)edge_delta * 1000u) / elapsed_ms);
	long_rate = (uint32_t)(((uint64_t)long_delta * 1000u) / elapsed_ms);
	glitch_permille = edge_delta ?
		(uint32_t)(((uint64_t)glitch_delta * 1000u) / edge_delta) : 0u;
#if OPENVLC_RX_RAW_INTERVAL_HIST
	{
		uint32_t short_rate_sum = 0u;

		for (size_t bin = 0u; bin < 5u; bin++) {
			uint32_t current = openvlc_edge_raw_short_hist[bin];
			uint32_t delta = current - previous_raw_short[bin];

			previous_raw_short[bin] = current;
			raw_short_rate[bin] = (uint32_t)(
				((uint64_t)delta * 1000u) / elapsed_ms);
			short_rate_sum += raw_short_rate[bin];
		}
		raw_ge24_rate = edge_rate > short_rate_sum ?
			edge_rate - short_rate_sum : 0u;
	}
#endif
	cc = openvlc_app_counters();
	burst_delta = openvlc_edge_bursts_decoded - previous_bursts;
	seen_delta = (cc ? cc->frames_seen : 0u) - previous_seen;
	ok_delta = (cc ? cc->frames_delivered : 0u) - previous_ok;
	burst_rate = (uint32_t)(((uint64_t)burst_delta * 1000u) / elapsed_ms);
	seen_rate = (uint32_t)(((uint64_t)seen_delta * 1000u) / elapsed_ms);
	ok_rate = (uint32_t)(((uint64_t)ok_delta * 1000u) / elapsed_ms);
	decode_last_us = (uint32_t)(((uint64_t)openvlc_decode_last_ticks *
				     1000000u) / OPENVLC_TIM2_IC_TICK_HZ);
	decode_max_us = (uint32_t)(((uint64_t)openvlc_decode_max_ticks *
				    1000000u) / OPENVLC_TIM2_IC_TICK_HZ);
#if OPENVLC_RX_DEEP_DEBUG_LOG && \
	(defined(STM32H743xx) || defined(STM32H723xx))
	comp_change_delta = openvlc_comp_level_changes - previous_comp_changes;
	comp_change_rate = (uint32_t)(((uint64_t)comp_change_delta * 1000u) /
				      elapsed_ms);
	previous_comp_changes = openvlc_comp_level_changes;
#endif
	previous_bursts = openvlc_edge_bursts_decoded;
	previous_seen = cc ? cc->frames_seen : 0u;
	previous_ok = cc ? cc->frames_delivered : 0u;
#if defined(STM32H743xx) || defined(STM32H723xx)
	{
		static uint64_t duty_last_high;
		static uint64_t duty_last_total;
		uint32_t duty = comp_duty_window(&duty_last_high,
						 &duty_last_total);

		/*
		 * Always report the windowed comparator duty and the DAC/mV it
		 * corresponds to. Validate on the bench that duty falls as the
		 * threshold (mV) rises and crosses ~500 permille at the centre
		 * before enabling OPENVLC_COMP_DUTY_SERVO.
		 */
		if (duty != UINT32_MAX)
			openvlc_platform_log(
				"COMP DUTY duty=%lu.%lu%% last=%lu.%lu%% thr_dac=%lu thr_mv=%lu\r\n",
				(unsigned long)(duty / 10u),
				(unsigned long)(duty % 10u),
				(unsigned long)(openvlc_comp_duty_permille_last /
						10u),
				(unsigned long)(openvlc_comp_duty_permille_last %
						10u),
				(unsigned long)HAL_DAC_GetValue(&hdac1,
								DAC_CHANNEL_1),
				(unsigned long)OPENVLC_DAC_TO_MV(
					HAL_DAC_GetValue(&hdac1,
							 DAC_CHANNEL_1)));
	}
	threshold_dac = HAL_DAC_GetValue(&hdac1, DAC_CHANNEL_1);
#if OPENVLC_RX_DEEP_DEBUG_LOG
	comp_level = (COMP12->SR & COMP_SR_C1VAL) != 0u ? 1u : 0u;
#endif
#endif

	/*
	 * Plain-text console output is blocking, so pause capture before writing
	 * diagnostics. Host-forward mode only queues the text; TIM2/DMA continues
	 * running and the queue is drained later from the main loop.
	 */
#if !OPENVLC_RX_HOST_FORWARD
	if (edge_capture_running) {
		edge_capture_stop();
		if (edge_burst_len)
			openvlc_edge_partial_drops++;
		edge_burst_len = 0;
		edge_burst_raw_len = 0;
		edge_burst_overflowed = false;
		edge_have_last = false;
		resume_capture = true;
	}
#endif

