lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
#if OPENVLC_COMP_THRESHOLD_SWEEP && !OPENVLC_COMP_THRESHOLD_AUTO && \
	(defined(STM32H743xx) || defined(STM32H723xx))
	{
		static uint32_t sweep_thr = OPENVLC_COMP_SWEEP_MIN;
		static uint32_t sweep_change_ms;
		static uint32_t sweep_ok_mark;
		static bool sweep_init;

		if (!sweep_init) {
			sweep_init = true;
			sweep_change_ms = now_ms;
			sweep_ok_mark = cc ? cc->frames_delivered : 0u;
			HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R,
					 sweep_thr);
		}
		if (now_ms - sweep_change_ms >=
		    OPENVLC_COMP_SWEEP_DWELL_S * 1000u) {
			uint32_t oknow = cc ? cc->frames_delivered : 0u;
			uint32_t prev = sweep_thr;
			uint32_t delivered = oknow - sweep_ok_mark;

			sweep_thr += OPENVLC_COMP_SWEEP_STEP;
			if (sweep_thr > OPENVLC_COMP_SWEEP_MAX)
				sweep_thr = OPENVLC_COMP_SWEEP_MIN;
			HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R,
					 sweep_thr);
			sweep_change_ms = now_ms;
			sweep_ok_mark = oknow;
			openvlc_platform_log("COMP SWEEP thr=%lu thr_mv=%lu delivered=%lu c0=%lu c1=%lu duty=%lu next_thr=%lu\r\n",
					     (unsigned long)prev,
					     (unsigned long)OPENVLC_DAC_TO_MV(prev),
					     (unsigned long)delivered,
					     (unsigned long)openvlc_phy_dbg_track_cell0_end,
					     (unsigned long)openvlc_phy_dbg_track_cell1_end,
					     (unsigned long)((openvlc_phy_dbg_track_cell1_end *
							      1000u) /
						(openvlc_phy_dbg_track_cell0_end +
						 openvlc_phy_dbg_track_cell1_end + 1u)),
					     (unsigned long)sweep_thr);
		}
	}
#endif

	openvlc_platform_log("COMP ep=%lu bp=%lu sp=%lu okp=%lu gpm=%lu"
#if OPENVLC_RX_RAW_INTERVAL_HIST
			     " r07=%lu r811=%lu r1215=%lu r1619=%lu r2023=%lu r24p=%lu"
#endif
			     " gd=%lu lp=%lu hc=%lu t0=%lu t1=%lu tn=%lu trq=%lu thr=%lu seen=%lu ok=%lu crc=%lu sync=%lu hq=%lu hd=%lu rp=%lu rd=%lu hwo=%lu ovf=%lu fr=%lu fa=%lu fg=%lu sg=%lu/%lu/%lu/%lu hb=%lu db=%lu br=%lu bl=%lu bok=%lu bf=%lu bsh=%lu bst=%ld du=%lu dm=%lu sf=%lu lock=%lu ss=%lu pre=%lu pbad=%lu pse=%lu se=%lu m=%lu pe=%lu ps=%ld ft=%lu fn=%lu fp=%lu fx=%lu fc=%lu fl=%lu fo=%lu fi=%lu sc=%lu jit=%lu.%lu\r\n",
			     (unsigned long)edge_rate,
			     (unsigned long)burst_rate,
			     (unsigned long)seen_rate,
			     (unsigned long)ok_rate,
			     (unsigned long)glitch_permille,
#if OPENVLC_RX_RAW_INTERVAL_HIST
			     (unsigned long)raw_short_rate[0],
			     (unsigned long)raw_short_rate[1],
			     (unsigned long)raw_short_rate[2],
			     (unsigned long)raw_short_rate[3],
			     (unsigned long)raw_short_rate[4],
			     (unsigned long)raw_ge24_rate,
#endif
			     (unsigned long)openvlc_edge_gaps_seen,
			     (unsigned long)long_rate,
			     (unsigned long)openvlc_phy_dbg_sps,
			     (unsigned long)openvlc_phy_dbg_track_cell0_end,
			     (unsigned long)openvlc_phy_dbg_track_cell1_end,
			     (unsigned long)openvlc_phy_dbg_track_nominal_end,
			     (unsigned long)openvlc_phy_dbg_timing_residual_peak,
			     (unsigned long)threshold_dac,
			     (unsigned long)(cc ? cc->frames_seen : 0u),
			     (unsigned long)(cc ? cc->frames_delivered : 0u),
			     (unsigned long)(cc ? cc->crc_failed : 0u),
			     (unsigned long)(cc ? cc->sync_failed : 0u),
			     (unsigned long)openvlc_host_frames_queued,
			     (unsigned long)openvlc_host_frames_dropped,
			     (unsigned long)openvlc_edge_ring_peak,
			     (unsigned long)openvlc_edge_ring_drops,
			     (unsigned long)openvlc_edge_hw_overcaptures,
			     (unsigned long)openvlc_edge_overflows,
			     (unsigned long)openvlc_frag_count,
			     (unsigned long)openvlc_frag_last_at,
			     (unsigned long)(openvlc_frag_last_gap_ticks /
					     (OPENVLC_TIM2_IC_TICK_HZ / 1000000u)),
			     (unsigned long)openvlc_edge_soft_gap_probes,
			     (unsigned long)openvlc_edge_soft_gap_completed,
			     (unsigned long)openvlc_edge_soft_gap_bridged,
			     (unsigned long)openvlc_edge_soft_gap_reused,
			     (unsigned long)openvlc_rx_hypothesis_budget,
			     (unsigned long)openvlc_rx_last_decode_budget,
			     (unsigned long)openvlc_edge_last_raw_burst_len,
			     (unsigned long)openvlc_edge_last_burst_len,
			     (unsigned long)openvlc_edge_last_ok_burst_len,
			     (unsigned long)openvlc_edge_last_fail_burst_len,
			     (unsigned long)openvlc_edge_last_short_burst_len,
			     (long)openvlc_edge_last_decode_status,
			     (unsigned long)decode_last_us,
			     (unsigned long)decode_max_us,
			     (unsigned long)openvlc_phy_dbg_sfdsync_result,
			     (unsigned long)openvlc_phy_dbg_sfdsync_lock_cell,
			     (unsigned long)openvlc_phy_dbg_sfdsync_syncs,
			     (unsigned long)openvlc_phy_dbg_sfdsync_pre_rejects,
			     (unsigned long)openvlc_phy_dbg_sfdsync_pre_badmax,
			     (unsigned long)openvlc_phy_dbg_sfdsync_pre_sfdmin,
			     (unsigned long)openvlc_phy_dbg_sfdsync_sfd_errors,
			     (unsigned long)openvlc_phy_dbg_sfdsync_mode,
			     (unsigned long)openvlc_phy_dbg_phase_edits,
			     (long)openvlc_phy_dbg_parse_status,
			     (unsigned long)openvlc_phy_dbg_sfdsync_fail_timing,
			     (unsigned long)openvlc_phy_dbg_sfdsync_fail_no_sfd,
			     (unsigned long)openvlc_phy_dbg_sfdsync_fail_preamble,
			     (unsigned long)openvlc_phy_dbg_sfdsync_fail_parse,
			     (unsigned long)openvlc_phy_dbg_sfdsync_fail_crc,
			     (unsigned long)openvlc_phy_dbg_sfdsync_fail_len,
			     (unsigned long)openvlc_phy_dbg_sfdsync_fail_overflow,
			     (unsigned long)openvlc_phy_dbg_sfdsync_fail_incomplete,
			     /*
			      * Quality is a per-packet measurement: report it only
			      * when at least one frame was delivered in this log
			      * window, and consume the snapshot afterwards. A
			      * stale snapshot must never masquerade as a live
			      * measurement.
			      */
			     (unsigned long)(openvlc_last_quality_valid && ok_delta ?
					     openvlc_last_quality.link_quality : 0u),
			     (unsigned long)((openvlc_last_quality_valid && ok_delta ?
					      openvlc_last_quality.timing_jitter_x1000 : 0u) / 10u),
			     (unsigned long)((openvlc_last_quality_valid && ok_delta ?
					      openvlc_last_quality.timing_jitter_x1000 : 0u) % 10u));
	if (!ok_delta)
		openvlc_last_quality_valid = 0u;
#if OPENVLC_RX_DEEP_DEBUG_LOG && \
	(defined(STM32H743xx) || defined(STM32H723xx))
	openvlc_platform_log("COMPHW level=%lu swchg=%lu swchgps=%lu samples=%lu test0hi=%lu testfhi=%lu dor0=%lu dorf=%lu dac_cr=0x%08lx dac_mcr=0x%08lx cfgr=0x%08lx sr=0x%08lx pb0mode=%lu pc5mode=%lu pc5af=%lu tim_cr1=0x%08lx ccmr2=0x%08lx ccer=0x%08lx dier=0x%08lx tim_sr=0x%08lx cnt=%lu tisel=0x%08lx dma_cr=0x%08lx ndtr=%lu dmamux=%lu\r\n",
			     (unsigned long)comp_level,
			     (unsigned long)openvlc_comp_level_changes,
			     (unsigned long)comp_change_rate,
			     (unsigned long)openvlc_comp_level_samples,
			     (unsigned long)openvlc_comp_test_zero_high,
			     (unsigned long)openvlc_comp_test_full_high,
			     (unsigned long)openvlc_comp_test_zero_dor,
			     (unsigned long)openvlc_comp_test_full_dor,
			     (unsigned long)DAC1->CR,
			     (unsigned long)DAC1->MCR,
			     (unsigned long)COMP1->CFGR,
			     (unsigned long)COMP12->SR,
			     (unsigned long)(GPIOB->MODER & 3u),
			     (unsigned long)((GPIOC->MODER >> (5u * 2u)) & 3u),
			     (unsigned long)((GPIOC->AFR[0] >> (5u * 4u)) & 15u),
			     (unsigned long)TIM2->CR1,
			     (unsigned long)TIM2->CCMR2,
			     (unsigned long)TIM2->CCER,
			     (unsigned long)TIM2->DIER,
			     (unsigned long)TIM2->SR,
			     (unsigned long)TIM2->CNT,
			     (unsigned long)TIM2->TISEL,
			     (unsigned long)DMA1_Stream1->CR,
			     (unsigned long)DMA1_Stream1->NDTR,
			     (unsigned long)(DMAMUX1_Channel1->CCR &
					     DMAMUX_CxCR_DMAREQ_ID));
#endif
	/* Per-interval watermark: reset after each report so the COMP line
	 * shows the ring backlog of the LAST second, not an all-time maximum
	 * dominated by the startup flood. */
	openvlc_edge_ring_peak = 0;
#if OPENVLC_RX_RATE_LOG
	openvlc_platform_log("RXRATE burstps=%lu seenps=%lu okps=%lu dec_us=%lu decmax_us=%lu gap_us=%u/%u sg=%lu/%lu/%lu/%lu\r\n",
			     (unsigned long)burst_rate,
			     (unsigned long)seen_rate,
			     (unsigned long)ok_rate,
			     (unsigned long)decode_last_us,
			     (unsigned long)decode_max_us,
			     (unsigned int)OPENVLC_EDGE_GAP_US,
			     (unsigned int)OPENVLC_EDGE_HARD_GAP_US,
			     (unsigned long)openvlc_edge_soft_gap_probes,
			     (unsigned long)openvlc_edge_soft_gap_completed,
			     (unsigned long)openvlc_edge_soft_gap_bridged,
			     (unsigned long)openvlc_edge_soft_gap_reused);
#endif
	openvlc_decode_max_ticks = 0u;
#if OPENVLC_RX_DEEP_DEBUG_LOG
	openvlc_platform_log("FRAG count=%lu last_at=%lu last_gap_us=%lu\r\n",
			     (unsigned long)openvlc_frag_count,
			     (unsigned long)openvlc_frag_last_at,
			     (unsigned long)(openvlc_frag_last_gap_ticks /
					     (OPENVLC_TIM2_IC_TICK_HZ / 1000000u)));
	openvlc_platform_log("PHY status=%ld stage=%lu pstat=%ld payload=%lu len_raw=%lu sps=%lu edges=%lu\r\n",
			     (long)openvlc_app_last_status(),
			     (unsigned long)openvlc_phy_dbg_stage,
			     (long)openvlc_phy_dbg_parse_status,
			     (unsigned long)openvlc_phy_dbg_payload_len,
			     (unsigned long)openvlc_phy_dbg_len_raw,
			     (unsigned long)openvlc_phy_dbg_sps,
			     (unsigned long)openvlc_phy_dbg_sample_len);
	openvlc_platform_log("SFDSYNC single=%lu cell=%lu/%lu train=%lu sfderr=%lu split=%lu syncs=%lu pre_rej=%lu relock=%lu mode=%lu phase_edits=%lu maxbits=%lu lenraw=%lu res=%lu lock=%lu\r\n",
			     (unsigned long)openvlc_phy_dbg_sfdsync_single,
			     (unsigned long)openvlc_phy_dbg_sfdsync_cell0,
			     (unsigned long)openvlc_phy_dbg_sfdsync_cell1,
			     (unsigned long)openvlc_phy_dbg_sfdsync_train,
			     (unsigned long)openvlc_phy_dbg_sfdsync_sfd_errors,
			     (unsigned long)openvlc_phy_dbg_sfdsync_split,
			     (unsigned long)openvlc_phy_dbg_sfdsync_syncs,
			     (unsigned long)openvlc_phy_dbg_sfdsync_pre_rejects,
			     (unsigned long)openvlc_phy_dbg_sfdsync_relocks,
			     (unsigned long)openvlc_phy_dbg_sfdsync_mode,
			     (unsigned long)openvlc_phy_dbg_phase_edits,
			     (unsigned long)openvlc_phy_dbg_sfdsync_maxbits,
			     (unsigned long)openvlc_phy_dbg_sfdsync_lenraw,
			     (unsigned long)openvlc_phy_dbg_sfdsync_result,
			     (unsigned long)openvlc_phy_dbg_sfdsync_lock_cell);
#endif
#if !OPENVLC_RX_HOST_FORWARD
	if (resume_capture && edge_capture_restart_synced() != 0) {
		openvlc_platform_log(
			"COMP ERROR: capture restart after diagnostics failed\r\n");
		Error_Handler();
	}
#endif
#else
	(void)now_ms;
#endif
}
#if (defined(STM32H743xx) || defined(STM32H723xx)) && OPENVLC_RX_HOST_FORWARD
/*
 * Queue records while the optical burst is being decoded. The main loop
 * restarts TIM2/DMA before transmitting them, so serial output cannot extend
 * the optical receiver's blind interval.
 *
 * Wire format:
 *   A5 5A C3 | version=1 | type | sequence(BE) | length(BE) |
 *   payload | crc16_ccitt(version..payload, BE)
 */
/*
 * Each queue slot holds the COMPLETE wire frame, built at enqueue time in
 * main-loop context. The interrupt path then only has to start the next
 * transfer: no copies, no CRC in IRQ context, and the in-flight buffer is the
 * queue slot itself (popped only on completion).
 */
typedef struct {
	uint16_t wire_len;
	uint8_t wire[OPENVLC_MAX_PAYLOAD_BYTES + 11u];
} openvlc_host_record_t;

/* ~29 KB at depth 32: keep it in RAM_D1 with the other large CPU buffers. */
static openvlc_host_record_t host_queue[OPENVLC_HOST_QUEUE_DEPTH] OPENVLC_RX_BUFFER;
static uint16_t host_next_sequence;
static volatile uint8_t host_queue_head;
static volatile uint8_t host_queue_tail;
static volatile uint8_t host_queue_count;
static volatile bool host_tx_busy;

