lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
/*
 * Start transmitting the record at the queue tail. Must be called either from
 * a USART3/DMA completion ISR or with interrupts masked, with host_tx_busy
 * already true.
 * The record is popped by the completion callback, not here, so the buffer
 * stays valid for the whole transfer.
 */
static void host_tx_start(void)
{
	openvlc_host_record_t *record = &host_queue[host_queue_tail];

#if OPENVLC_ENABLE_DCACHE
	/*
	 * host_queue[] lives in the cacheable final 64 KB of AXI SRAM. DMA1 sees
	 * main memory rather than dirty D-cache lines, so publish the complete wire
	 * record before handing it to USART3 TX DMA.
	 */
	{
		uintptr_t start = (uintptr_t)record->wire & ~(uintptr_t)31u;
		uintptr_t end = ((uintptr_t)record->wire + record->wire_len + 31u) &
				~(uintptr_t)31u;

		SCB_CleanDCache_by_Addr((uint32_t *)start,
					   (int32_t)(end - start));
		__DSB();
	}
#endif
	if (HAL_UART_Transmit_DMA(&huart3, record->wire,
				  record->wire_len) != HAL_OK) {
		/* Drop this record and give up until the next poll. */
		openvlc_host_tx_errors++;
		if (++host_queue_tail >= OPENVLC_HOST_QUEUE_DEPTH)
			host_queue_tail = 0u;
		host_queue_count--;
		host_tx_busy = false;
	} else {
		/* Only transfer-complete/error events are useful for normal-mode TX. */
		__HAL_DMA_DISABLE_IT(huart3.hdmatx, DMA_IT_HT);
	}
}

/*
 * Transfer complete: pop the sent record and chain the next one immediately
 * from IRQ context. DMA removes the former per-byte TXE interrupt load while
 * keeping the UART wire fully utilised independently of main-loop cadence.
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if (huart->Instance != USART3)
		return;
	openvlc_host_frames_sent++;
	if (++host_queue_tail >= OPENVLC_HOST_QUEUE_DEPTH)
		host_queue_tail = 0u;
	host_queue_count--;
	if (host_queue_count)
		host_tx_start();
	else
		host_tx_busy = false;
}

/*
 * CubeMX does not enable the USART3 interrupt (the .ioc has it off), so the
 * IRQ handler and the NVIC enable live here, where they survive code
 * regeneration. Priority is low: the TX path is not time-critical compared to
 * the capture path.
 */
void USART3_IRQHandler(void)
{
	uint32_t isr;
	uint32_t rx_errors;

	openvlc_diag_usart3_irq_count++;
	openvlc_diag_usart3_irq_phase = 1u;
	isr = USART3->ISR;
	openvlc_diag_usart3_last_isr = isr;

	/* RX uses permanent circular DMA. Consume receive errors here and reserve
	 * HAL_UART_IRQHandler() for the final DMA-TX TC event. */
	rx_errors = isr & (USART_ISR_PE | USART_ISR_FE |
			   USART_ISR_NE | USART_ISR_ORE);
	if (rx_errors != 0u) {
		uint32_t clear = 0u;

		openvlc_diag_usart3_error_count++;
		if ((rx_errors & USART_ISR_PE) != 0u)
			clear |= UART_CLEAR_PEF;
		if ((rx_errors & USART_ISR_FE) != 0u)
			clear |= UART_CLEAR_FEF;
		if ((rx_errors & USART_ISR_NE) != 0u)
			clear |= UART_CLEAR_NEF;
		if ((rx_errors & USART_ISR_ORE) != 0u) {
			clear |= UART_CLEAR_OREF;
			openvlc_diag_usart3_overrun_count++;
		}
		__HAL_UART_CLEAR_FLAG(&huart3, clear);
		huart3.ErrorCode = HAL_UART_ERROR_NONE;
	}
	openvlc_diag_usart3_irq_phase = 3u;
	HAL_UART_IRQHandler(&huart3);
	openvlc_diag_usart3_irq_phase = 0u;
}

static bool host_frame_enqueue(uint8_t type, const uint8_t *data, uint16_t len)
{
	openvlc_host_record_t *record;
	uint16_t crc;
	uint16_t sequence = host_next_sequence++;
	uint32_t primask;

	/*
	 * The sequence number advances even when the record is dropped, so the
	 * bridge's seq_gap counter directly measures records lost here.
	 */
	if ((!data && len) || len > OPENVLC_MAX_PAYLOAD_BYTES ||
	    host_queue_count >= OPENVLC_HOST_QUEUE_DEPTH) {
		openvlc_host_frames_dropped++;
		return false;
	}
	/*
	 * The head slot is free (count < depth) and the ISR only ever touches
	 * the tail, so the wire frame can be built without locking.
	 */
	record = &host_queue[host_queue_head];
	record->wire[0] = 0xA5u;
	record->wire[1] = 0x5Au;
	record->wire[2] = 0xC3u;
	record->wire[3] = 0x01u;
	record->wire[4] = type;
	record->wire[5] = (uint8_t)(sequence >> 8);
	record->wire[6] = (uint8_t)sequence;
	record->wire[7] = (uint8_t)(len >> 8);
	record->wire[8] = (uint8_t)len;
	if (len)
		memcpy(&record->wire[9], data, len);
	crc = openvlc_crc16_ccitt(&record->wire[3], (size_t)len + 6u);
	record->wire[9u + len] = (uint8_t)(crc >> 8);
	record->wire[10u + len] = (uint8_t)crc;
	record->wire_len = (uint16_t)(len + 11u);
	/* Publish the slot: head/count are shared with UART/DMA completion ISRs. */
	primask = __get_PRIMASK();
	__disable_irq();
	if (++host_queue_head >= OPENVLC_HOST_QUEUE_DEPTH)
		host_queue_head = 0u;
	host_queue_count++;
	if (!primask)
		__enable_irq();
	openvlc_host_frames_queued++;
	return true;
}

#if OPENVLC_RX_CAPTURE
#define OPENVLC_HOST_TYPE_CAPTURE 0x03u
#define OPENVLC_CAPTURE_MAGIC 0x4f564354u
#define OPENVLC_CAPTURE_VERSION 2u
#define OPENVLC_CAPTURE_BEGIN 1u
#define OPENVLC_CAPTURE_DATA 2u
#define OPENVLC_CAPTURE_END 3u
#define OPENVLC_CAPTURE_BEGIN_LEN 88u
#define OPENVLC_CAPTURE_DATA_HEADER_LEN 16u
#define OPENVLC_CAPTURE_END_LEN 20u

static void capture_put_u16(uint8_t *out, uint16_t value)
{
	out[0] = (uint8_t)(value >> 8);
	out[1] = (uint8_t)value;
}

static void capture_put_u32(uint8_t *out, uint32_t value)
{
	out[0] = (uint8_t)(value >> 24);
	out[1] = (uint8_t)(value >> 16);
	out[2] = (uint8_t)(value >> 8);
	out[3] = (uint8_t)value;
}

static void capture_put_prefix(uint8_t *out, uint8_t kind)
{
	capture_put_u32(out, OPENVLC_CAPTURE_MAGIC);
	out[4] = OPENVLC_CAPTURE_VERSION;
	out[5] = kind;
}

static void rx_capture_dump_poll(void)
{
	static uint32_t last_emit_ms;
	uint8_t record[OPENVLC_CAPTURE_DATA_HEADER_LEN +
		       2u * OPENVLC_RX_CAPTURE_CHUNK_INTERVALS];
	uint32_t now_ms;
	uint16_t length = 0u;

	if (rx_capture_state == RX_CAPTURE_ARMED ||
	    rx_capture_state == RX_CAPTURE_DONE)
		return;
	now_ms = HAL_GetTick();
	if (now_ms - last_emit_ms < OPENVLC_RX_CAPTURE_PERIOD_MS)
		return;
	/*
	 * Preserve two slots for a decoded IP packet and its ordinary health log.
	 * If the UART queue is momentarily busy, retain the current dump offset
	 * and retry later; the trace can therefore never contain silent holes.
	 */
	if (host_queue_count >= OPENVLC_HOST_QUEUE_DEPTH - 2u)
		return;

	switch (rx_capture_state) {
	case RX_CAPTURE_BEGIN:
		capture_put_prefix(record, OPENVLC_CAPTURE_BEGIN);
		record[6] = rx_capture_trigger;
		record[7] = (rx_capture_clipped ? 1u : 0u) |
			(OPENVLC_RX_CAPTURE_RAW ? 2u : 0u);
		capture_put_u32(&record[8], rx_capture_id);
		capture_put_u32(&record[12], OPENVLC_TIM2_IC_TICK_HZ);
		capture_put_u32(&record[16], rx_capture_count);
		capture_put_u32(&record[20], rx_capture_count + 1u);
		capture_put_u32(&record[24],
				(uint32_t)rx_capture_status);
		capture_put_u32(&record[28],
				(uint32_t)rx_capture_parse_status);
		capture_put_u32(&record[32], OPENVLC_PHY_RATE_KBPS);
		capture_put_u32(&record[36],
				rx_capture_threshold_dac);
		capture_put_u32(&record[40],
				(rx_capture_threshold_dac * 3300u +
				 2047u) / 4095u);
		capture_put_u32(&record[44], rx_capture_t0);
		capture_put_u32(&record[48], rx_capture_t1);
		capture_put_u32(&record[52], rx_capture_nominal);
		capture_put_u32(&record[56],
				rx_capture_residual_q8);
		capture_put_u32(&record[60], rx_capture_syncs);
		capture_put_u32(&record[64], rx_capture_mode);
		capture_put_u32(&record[68],
				rx_capture_hypothesis_budget);
		capture_put_u32(&record[72], rx_capture_lock);
		capture_put_u32(&record[76], rx_capture_len_raw);
		capture_put_u32(&record[80],
				rx_capture_snapshot_ms);
		capture_put_u32(&record[84], rx_capture_hash);
		length = OPENVLC_CAPTURE_BEGIN_LEN;
		break;
	case RX_CAPTURE_DATA: {
		uint32_t start = rx_capture_position;
		uint32_t remaining = rx_capture_count - start;
		uint16_t emitted = remaining >
			OPENVLC_RX_CAPTURE_CHUNK_INTERVALS ?
			OPENVLC_RX_CAPTURE_CHUNK_INTERVALS :
			(uint16_t)remaining;

