lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_hal.c
		capture_put_prefix(record, OPENVLC_CAPTURE_DATA);
		capture_put_u16(&record[6], emitted);
		capture_put_u32(&record[8], rx_capture_id);
		capture_put_u32(&record[12], start);
		for (uint16_t i = 0u; i < emitted; i++) {
			capture_put_u16(
				&record[OPENVLC_CAPTURE_DATA_HEADER_LEN +
					2u * i],
				rx_capture_intervals[rx_capture_position]);
			rx_capture_position++;
		}
		length = (uint16_t)(OPENVLC_CAPTURE_DATA_HEADER_LEN +
				    2u * emitted);
		break;
	}
	case RX_CAPTURE_END:
		capture_put_prefix(record, OPENVLC_CAPTURE_END);
		record[6] = (rx_capture_clipped ? 1u : 0u) |
			(OPENVLC_RX_CAPTURE_RAW ? 2u : 0u);
		record[7] = 0u;
		capture_put_u32(&record[8], rx_capture_id);
		capture_put_u32(&record[12], rx_capture_count);
		capture_put_u32(&record[16], rx_capture_hash);
		length = OPENVLC_CAPTURE_END_LEN;
		break;
	default:
		return;
	}
	if (!host_frame_enqueue(OPENVLC_HOST_TYPE_CAPTURE, record, length))
		return;

	last_emit_ms = now_ms;
	if (rx_capture_state == RX_CAPTURE_BEGIN)
		rx_capture_state = RX_CAPTURE_DATA;
	else if (rx_capture_state == RX_CAPTURE_DATA &&
		 rx_capture_position >= rx_capture_count)
		rx_capture_state = RX_CAPTURE_END;
	else if (rx_capture_state == RX_CAPTURE_END) {
		/*
		 * The END record is already copied into the host queue, so the
		 * snapshot buffer can be reused safely. Start a fresh frame-spacing
		 * window so adjacent captures cannot dominate either population.
		 */
		rx_capture_frame_gap = 0u;
		rx_capture_state = rx_capture_all_quotas_full() ?
			RX_CAPTURE_DONE : RX_CAPTURE_ARMED;
	}
}
#endif
#endif

void openvlc_stm32_host_poll(void)
{
#if (defined(STM32H743xx) || defined(STM32H723xx)) && OPENVLC_RX_HOST_FORWARD
	uint32_t primask;

#if OPENVLC_RX_CAPTURE
	rx_capture_dump_poll();
#endif
	/*
	 * Only the FIRST record of an idle period is kicked from here; after
	 * that the completion interrupt chains the queue on its own.
	 */
	if (host_tx_busy || !host_queue_count)
		return;
	primask = __get_PRIMASK();
	__disable_irq();
	if (!host_tx_busy && host_queue_count) {
		host_tx_busy = true;
		host_tx_start();
	}
	if (!primask)
		__enable_irq();
#endif
}

void openvlc_platform_log(const char *fmt, ...)
{
	char buf[512];
	va_list ap;
	int n;

	va_start(ap, fmt);
	n = vsnprintf(buf, sizeof(buf), fmt, ap);
	va_end(ap);
	if (n <= 0)
		return;
	if ((size_t)n >= sizeof(buf))
		n = (int)sizeof(buf) - 1;
#if defined(STM32H743xx) || defined(STM32H723xx)
#if OPENVLC_RX_HOST_FORWARD
	/*
	 * Keep one queue slot available for a decoded IP packet. A success log is
	 * emitted immediately before openvlc_platform_on_packet(), so allowing
	 * logs to fill the queue could discard useful data while retaining only
	 * its diagnostic line.
	 */
	if (OPENVLC_HOST_QUEUE_DEPTH > 1u &&
	    host_queue_count < OPENVLC_HOST_QUEUE_DEPTH - 1u)
		(void)host_frame_enqueue(0x02u, (const uint8_t *)buf,
					 (uint16_t)n);
	else
		openvlc_host_frames_dropped++;
#else
	HAL_UART_Transmit(&huart3, (uint8_t *)buf, (uint16_t)n, 100);
#endif
#else
	fwrite(buf, 1, (size_t)n, stdout);
#endif
}

void openvlc_platform_on_packet(const openvlc_packet_t *packet,
				const openvlc_quality_t *quality)
{
	if (quality) {
		openvlc_last_quality = *quality;
		openvlc_last_quality_valid = 1u;
	}
#if (defined(STM32H743xx) || defined(STM32H723xx)) && OPENVLC_RX_HOST_FORWARD
#ifdef OPENVLC_TX_SRC_ADDR
	/*
	 * A frame carrying our own TX source address is our own light coupled
	 * back into the local photodiode. Forwarding it would let the Pi route
	 * it back out tun0 -> re-transmission -> a traffic feedback loop that
	 * inflates the TX load and destabilises the LED. Drop it here.
	 * NOTE: the two transceivers MUST therefore use different
	 * OPENVLC_TX_SRC_ADDR values (e.g. 7 and 8, dst mirrored).
	 */
	if (packet->src == OPENVLC_TX_SRC_ADDR) {
		openvlc_rx_self_dropped++;
		return;
	}
#endif
	/* Forward the decoded IP datagram to the Pi bridge -> tun0. */
	(void)host_frame_enqueue(0x01u, packet->payload, packet->payload_len);
#else
	openvlc_platform_log("payload_len=%u first=%02x\r\n",
			     packet->payload_len,
			     packet->payload_len ? packet->payload[0] : 0);
#endif
}
